/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const ENOSR: u32 = 98;
pub const ENOSTR: u32 = 99;
pub const EPROTO: u32 = 100;
pub const ETIME: u32 = 101;
pub const EOPNOTSUPP: u32 = 102;
pub const ENOPOLICY: u32 = 103;
pub const ENOTRECOVERABLE: u32 = 104;
pub const EOWNERDEAD: u32 = 105;
pub const EQFULL: u32 = 106;
pub const ELAST: u32 = 106;
pub const _PTHREAD_MUTEX_SIG_init: u32 = 850045863;
pub const _PTHREAD_ERRORCHECK_MUTEX_SIG_init: u32 = 850045857;
pub const _PTHREAD_RECURSIVE_MUTEX_SIG_init: u32 = 850045858;
pub const _PTHREAD_FIRSTFIT_MUTEX_SIG_init: u32 = 850045859;
pub const _PTHREAD_COND_SIG_init: u32 = 1018212795;
pub const _PTHREAD_ONCE_SIG_init: u32 = 816954554;
pub const _PTHREAD_RWLOCK_SIG_init: u32 = 766030772;
pub const SCHED_OTHER: u32 = 1;
pub const SCHED_FIFO: u32 = 4;
pub const SCHED_RR: u32 = 2;
pub const __SCHED_PARAM_SIZE__: u32 = 4;
pub const QOS_MIN_RELATIVE_PRIORITY: i32 = -15;
pub const PTHREAD_CREATE_JOINABLE: u32 = 1;
pub const PTHREAD_CREATE_DETACHED: u32 = 2;
pub const PTHREAD_INHERIT_SCHED: u32 = 1;
pub const PTHREAD_EXPLICIT_SCHED: u32 = 2;
pub const PTHREAD_CANCEL_ENABLE: u32 = 1;
pub const PTHREAD_CANCEL_DISABLE: u32 = 0;
pub const PTHREAD_CANCEL_DEFERRED: u32 = 2;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: u32 = 0;
pub const PTHREAD_SCOPE_SYSTEM: u32 = 1;
pub const PTHREAD_SCOPE_PROCESS: u32 = 2;
pub const PTHREAD_PROCESS_SHARED: u32 = 1;
pub const PTHREAD_PROCESS_PRIVATE: u32 = 2;
pub const PTHREAD_PRIO_NONE: u32 = 0;
pub const PTHREAD_PRIO_INHERIT: u32 = 1;
pub const PTHREAD_PRIO_PROTECT: u32 = 2;
pub const PTHREAD_MUTEX_NORMAL: u32 = 0;
pub const PTHREAD_MUTEX_ERRORCHECK: u32 = 1;
pub const PTHREAD_MUTEX_RECURSIVE: u32 = 2;
pub const PTHREAD_MUTEX_DEFAULT: u32 = 0;
pub const PTHREAD_MUTEX_POLICY_FAIRSHARE_NP: u32 = 1;
pub const PTHREAD_MUTEX_POLICY_FIRSTFIT_NP: u32 = 3;
pub const LC_ALL: u32 = 0;
pub const LC_COLLATE: u32 = 1;
pub const LC_CTYPE: u32 = 2;
pub const LC_MONETARY: u32 = 3;
pub const LC_NUMERIC: u32 = 4;
pub const LC_TIME: u32 = 5;
pub const LC_MESSAGES: u32 = 6;
pub const _LC_LAST: u32 = 7;
pub const LC_COLLATE_MASK: u32 = 1;
pub const LC_CTYPE_MASK: u32 = 2;
pub const LC_MESSAGES_MASK: u32 = 4;
pub const LC_MONETARY_MASK: u32 = 8;
pub const LC_NUMERIC_MASK: u32 = 16;
pub const LC_TIME_MASK: u32 = 32;
pub const _LC_NUM_MASK: u32 = 6;
pub const _LC_LAST_MASK: u32 = 32;
pub const _LIBCPP_HAS_CATOPEN: u32 = 1;
pub const __DARWIN_FD_SETSIZE: u32 = 1024;
pub const __DARWIN_NBBY: u32 = 8;
pub const NBBY: u32 = 8;
pub const FD_SETSIZE: u32 = 1024;
pub const NL_SETD: u32 = 1;
pub const NL_CAT_LOCALE: u32 = 1;
pub const _LIBCPP_GET_C_LOCALE: u32 = 0;
pub const YY_NULLPTR: u32 = 0;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nullptr_t {
    pub __lx: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nullptr_t___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_std_nullptr_t___nat() {
    assert_eq!(
        ::std::mem::size_of::<std_nullptr_t___nat>(),
        4usize,
        concat!("Size of: ", stringify!(std_nullptr_t___nat))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nullptr_t___nat>(),
        4usize,
        concat!("Alignment of ", stringify!(std_nullptr_t___nat))
    );
    fn test_field___for_bool_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_nullptr_t___nat>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__for_bool_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_nullptr_t___nat),
                "::",
                stringify!(__for_bool_)
            )
        );
    }
    test_field___for_bool_();
}
#[test]
fn bindgen_test_layout_std_nullptr_t() {
    assert_eq!(
        ::std::mem::size_of::<std_nullptr_t>(),
        8usize,
        concat!("Size of: ", stringify!(std_nullptr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nullptr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(std_nullptr_t))
    );
    fn test_field___lx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_nullptr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_nullptr_t),
                "::",
                stringify!(__lx)
            )
        );
    }
    test_field___lx();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringbuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_fstream {
    pub _address: u8,
}
pub type std_ios = std_basic_ios;
pub type std_wios = std_basic_ios;
pub type std_streambuf = std_basic_streambuf<::std::os::raw::c_char>;
pub type std_istream = std_basic_istream;
pub type std_ostream = std_basic_ostream;
pub type std_iostream = std_basic_iostream;
pub type std_stringbuf = std_basic_stringbuf;
pub type std_istringstream = std_basic_istringstream;
pub type std_ostringstream = std_basic_ostringstream;
pub type std_stringstream = std_basic_stringstream;
pub type std_filebuf = std_basic_filebuf;
pub type std_ifstream = std_basic_ifstream;
pub type std_ofstream = std_basic_ofstream;
pub type std_fstream = std_basic_fstream;
pub type std_wstreambuf = std_basic_streambuf<u32>;
pub type std_wistream = std_basic_istream;
pub type std_wostream = std_basic_ostream;
pub type std_wiostream = std_basic_iostream;
pub type std_wstringbuf = std_basic_stringbuf;
pub type std_wistringstream = std_basic_istringstream;
pub type std_wostringstream = std_basic_ostringstream;
pub type std_wstringstream = std_basic_stringstream;
pub type std_wfilebuf = std_basic_filebuf;
pub type std_wifstream = std_basic_ifstream;
pub type std_wofstream = std_basic_ofstream;
pub type std_wfstream = std_basic_fstream;
pub type std_streampos = std_fpos<mbstate_t>;
pub type std_wstreampos = std_fpos<mbstate_t>;
pub type std_u16streampos = std_fpos<mbstate_t>;
pub type std_u32streampos = std_fpos<mbstate_t>;
pub type std_streamoff = ::std::os::raw::c_longlong;
pub type std_string = std_basic_string;
pub type std_wstring = std_basic_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector {
    pub _address: u8,
}
#[repr(C)]
pub struct std___save_flags<_CharT> {
    pub __stream_: *mut std___save_flags___stream_type,
    pub __fmtflags_: std___save_flags_fmtflags,
    pub __fill_: _CharT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std___save_flags___stream_type = std_basic_ios;
pub type std___save_flags_fmtflags = std___save_flags___stream_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_integral {
    pub _address: u8,
}
pub const std___libcpp_is_integral_value: std___libcpp_is_integral__bindgen_ty_1 = 0;
pub type std___libcpp_is_integral__bindgen_ty_1 = i32;
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_char16_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_char32_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_integral_open0_unsigned___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_integral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_integral)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_debug_info {
    pub __file_: *const ::std::os::raw::c_char,
    pub __line_: ::std::os::raw::c_int,
    pub __pred_: *const ::std::os::raw::c_char,
    pub __msg_: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_std___libcpp_debug_info() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_debug_info>(),
        32usize,
        concat!("Size of: ", stringify!(std___libcpp_debug_info))
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_debug_info>(),
        8usize,
        concat!("Alignment of ", stringify!(std___libcpp_debug_info))
    );
    fn test_field___file_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___libcpp_debug_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__file_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___libcpp_debug_info),
                "::",
                stringify!(__file_)
            )
        );
    }
    test_field___file_();
    fn test_field___line_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___libcpp_debug_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__line_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std___libcpp_debug_info),
                "::",
                stringify!(__line_)
            )
        );
    }
    test_field___line_();
    fn test_field___pred_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___libcpp_debug_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pred_) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(std___libcpp_debug_info),
                "::",
                stringify!(__pred_)
            )
        );
    }
    test_field___pred_();
    fn test_field___msg_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___libcpp_debug_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__msg_) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(std___libcpp_debug_info),
                "::",
                stringify!(__msg_)
            )
        );
    }
    test_field___msg_();
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__119__libcpp_debug_info4whatEv"]
    pub fn std___libcpp_debug_info_what(this: *const std___libcpp_debug_info) -> std_string;
}
impl std___libcpp_debug_info {
    #[inline]
    pub unsafe fn what(&self) -> std_string {
        std___libcpp_debug_info_what(self)
    }
}
pub type std___libcpp_debug_function_type =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const std___libcpp_debug_info)>;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__libcpp_debug_functionE"]
    pub static mut std___libcpp_debug_function: std___libcpp_debug_function_type;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__129__libcpp_abort_debug_functionERKNS_19__libcpp_debug_infoE"]
    pub fn std___libcpp_abort_debug_function(arg1: *const std___libcpp_debug_info);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__127__libcpp_set_debug_functionEPFvRKNS_19__libcpp_debug_infoEE"]
    pub fn std___libcpp_set_debug_function(__func: std___libcpp_debug_function_type) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_function {
    pub _address: u8,
}
pub type std_binary_function_first_argument_type<_Arg1> = _Arg1;
pub type std_binary_function_second_argument_type<_Arg2> = _Arg2;
pub type std_binary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_function {
    pub _address: u8,
}
pub type std_unary_function_argument_type<_Arg> = _Arg;
pub type std_unary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_hash {
    pub _address: u8,
}
pub type std_integral_constant_value_type<_Tp> = _Tp;
pub type std_integral_constant_type = u8;
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std_value: _Tp;
}
pub type std_true_type = u8;
pub type std_false_type = u8;
pub type std__BoolConstant = u8;
pub type std__EnableIf = u8;
pub type std__If = u8;
pub type std__Or = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Not {
    pub _address: u8,
}
pub type std__FirstType = u8;
pub type std__SecondType = u8;
pub type std___expand_to_true = std_true_type;
pub type std__And<_Pred> = _Pred;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Lazy {
    pub _address: u8,
}
pub type std__IsValidExpansion = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___void_t {
    pub _address: u8,
}
pub type std___void_t_type = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___identity {
    pub _address: u8,
}
pub type std___identity_type<_Tp> = _Tp;
pub type std___identity_t = std___identity;
pub type std_conditional_type<_If> = _If;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_same {
    pub _address: u8,
}
pub type std__IsSame = std__BoolConstant;
pub type std__IsNotSame = std__BoolConstant;
pub type std___test_for_primary_template = std__EnableIf;
pub type std___is_primary_template = std__IsValidExpansion;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___two {
    pub __lx: [::std::os::raw::c_char; 2usize],
}
#[test]
fn bindgen_test_layout_std___two() {
    assert_eq!(
        ::std::mem::size_of::<std___two>(),
        2usize,
        concat!("Size of: ", stringify!(std___two))
    );
    assert_eq!(
        ::std::mem::align_of::<std___two>(),
        1usize,
        concat!("Alignment of ", stringify!(std___two))
    );
    fn test_field___lx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___two>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___two),
                "::",
                stringify!(__lx)
            )
        );
    }
    test_field___lx();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_const {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_volatile {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_volatile {
    pub _address: u8,
}
pub type std_remove_volatile_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type = std_remove_volatile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_void {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t_impl {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std___is_nullptr_t_impl_open0_std_nullptr_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_nullptr_t_impl>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_nullptr_t_impl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_nullptr_t_impl>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_nullptr_t_impl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t {
    pub _base: std___is_nullptr_t_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_integral {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_signed_integer {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_signed_integer_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_signed_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_signed_integer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_unsigned_integer {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned_char_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned_short_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned_int_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned_long_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned_long_long_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_unsigned_integer_open0_unsigned___int128_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_unsigned_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_unsigned_integer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_floating_point {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_floating_point_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_floating_point_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___libcpp_is_floating_point_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_is_floating_point>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___libcpp_is_floating_point)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_floating_point {
    pub _base: std___libcpp_is_floating_point,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_array {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_union {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_class {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_member_pointer {
    pub _address: u8,
}
pub const std___libcpp_is_member_pointer___is_member: std___libcpp_is_member_pointer__bindgen_ty_1 =
    0;
pub const std___libcpp_is_member_pointer___is_func: std___libcpp_is_member_pointer__bindgen_ty_1 =
    0;
pub const std___libcpp_is_member_pointer___is_obj: std___libcpp_is_member_pointer__bindgen_ty_1 = 0;
pub type std___libcpp_is_member_pointer__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_function_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_enum {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_fundamental {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_block {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_scalar {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_is_scalar_open0_std_nullptr_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_scalar>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_scalar)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_scalar>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_scalar)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_object {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_compound {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_referenceable_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___is_referenceable_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___is_referenceable_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___is_referenceable_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_referenceable_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___is_referenceable_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_referenceable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_const {
    pub _address: u8,
}
pub type std_add_const_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_volatile {
    pub _address: u8,
}
pub type std_add_volatile_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_cv {
    pub _address: u8,
}
pub type std_add_cv_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_reference {
    pub _address: u8,
}
pub type std_remove_reference_type<_Tp> = _Tp;
pub type std___add_lvalue_reference_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_lvalue_reference {
    pub _address: u8,
}
pub type std_add_lvalue_reference_type = u8;
pub type std___add_rvalue_reference_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_rvalue_reference {
    pub _address: u8,
}
pub type std_add_rvalue_reference_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uncvref {
    pub _address: u8,
}
pub type std___uncvref_type = std_remove_cv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unconstref {
    pub _address: u8,
}
pub type std___unconstref_type = std_remove_const;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_same_uncvref {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___any {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___any() {
    assert_eq!(
        ::std::mem::size_of::<std___any>(),
        1usize,
        concat!("Size of: ", stringify!(std___any))
    );
    assert_eq!(
        ::std::mem::align_of::<std___any>(),
        1usize,
        concat!("Alignment of ", stringify!(std___any))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15__anyC1Ez"]
    pub fn std___any___any(this: *mut std___any, ...);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_pointer {
    pub _address: u8,
}
pub type std_remove_pointer_type<_Tp> = _Tp;
pub type std___add_pointer_impl_type = *mut std_remove_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_pointer {
    pub _address: u8,
}
pub type std_add_pointer_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_signed {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_unsigned {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_rank {
    pub _base: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_extent {
    pub _address: u8,
}
pub type std_remove_extent_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_all_extents {
    pub _address: u8,
}
pub type std_remove_all_extents_type<_Tp> = _Tp;
pub type std___decay_type = std_remove_cv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_decay {
    pub _address: u8,
}
pub type std_decay__Up = std_remove_reference;
pub type std_decay_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_abstract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_final {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_base_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_core_convertible {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_empty {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_polymorphic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_has_virtual_destructor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_alignment_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_list {
    pub _address: u8,
}
pub type std___type_list__Head<_Hp> = _Hp;
pub type std___type_list__Tail<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___nat {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___nat() {
    assert_eq!(
        ::std::mem::size_of::<std___nat>(),
        1usize,
        concat!("Size of: ", stringify!(std___nat))
    );
    assert_eq!(
        ::std::mem::align_of::<std___nat>(),
        1usize,
        concat!("Alignment of ", stringify!(std___nat))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___align_type {
    pub _address: u8,
}
pub type std___align_type_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___struct_double {
    pub __lx: f64,
}
#[test]
fn bindgen_test_layout_std___struct_double() {
    assert_eq!(
        ::std::mem::size_of::<std___struct_double>(),
        8usize,
        concat!("Size of: ", stringify!(std___struct_double))
    );
    assert_eq!(
        ::std::mem::align_of::<std___struct_double>(),
        8usize,
        concat!("Alignment of ", stringify!(std___struct_double))
    );
    fn test_field___lx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___struct_double>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___struct_double),
                "::",
                stringify!(__lx)
            )
        );
    }
    test_field___lx();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___struct_double4 {
    pub __lx: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_std___struct_double4() {
    assert_eq!(
        ::std::mem::size_of::<std___struct_double4>(),
        32usize,
        concat!("Size of: ", stringify!(std___struct_double4))
    );
    assert_eq!(
        ::std::mem::align_of::<std___struct_double4>(),
        8usize,
        concat!("Alignment of ", stringify!(std___struct_double4))
    );
    fn test_field___lx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___struct_double4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___struct_double4),
                "::",
                stringify!(__lx)
            )
        );
    }
    test_field___lx();
}
pub type std___all_types = std___type_list;
extern "C" {
    #[link_name = "\u{1}__min"]
    pub static std___select_align___min: size_t;
}
extern "C" {
    #[link_name = "\u{1}__max"]
    pub static std___select_align___max: size_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___select_align_value: size_t;
}
pub type std_aligned_storage__Aligner = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub union std_aligned_storage_type {
    pub __align: std_aligned_storage__Aligner,
    pub __data: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_std_aligned_storage_type() {
    assert_eq!(
        ::std::mem::size_of::<std_aligned_storage_type>(),
        8usize,
        concat!("Size of: ", stringify!(std_aligned_storage_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std_aligned_storage_type>(),
        8usize,
        concat!("Alignment of ", stringify!(std_aligned_storage_type))
    );
}
pub type std_aligned_union_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___numeric_type {
    pub _address: u8,
}
pub type std___numeric_type_type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std___numeric_type_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___numeric_type>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___numeric_type)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___numeric_type>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___numeric_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___promote {
    pub _address: u8,
}
pub type std___signed_types = std___type_list;
pub type std___unsigned_types = std___type_list;
pub type std___apply_cv_type<_Up> = _Up;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_signed {
    pub _address: u8,
}
pub type std_make_signed_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type2_imp {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_types {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_common_type {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_common_type_open0_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_common_type>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_common_type)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_common_type>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_common_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___select_2nd {
    pub _address: u8,
}
pub type std___select_2nd_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_destructible_apply {
    pub _address: u8,
}
pub type std___is_destructible_apply_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_destructor_wellformed {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_destructible {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_is_destructible_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_destructible>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_destructible)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_destructible>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_destructible)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___member_pointer_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___member_pointer_class_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_nothrow_destructor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pod {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_literal_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_standard_layout {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copyable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivial {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_reference_wrapper_impl {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_reference_wrapper {
    pub _base: std___is_reference_wrapper_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_result_of {
    pub _address: u8,
}
pub type std___swap_result_t = ::std::os::raw::c_void;
pub type std___detail___swappable_with___swap1<_Tp> = _Tp;
pub type std___detail___swappable_with___swap2<_Up> = _Up;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_underlying_type {
    pub _address: u8,
}
pub type std___sfinae_underlying_type_type = std_underlying_type;
pub type std___sfinae_underlying_type___promoted_type = std___sfinae_underlying_type_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_fail_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___extract_key_fail_tag() {
    assert_eq!(
        ::std::mem::size_of::<std___extract_key_fail_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std___extract_key_fail_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std___extract_key_fail_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std___extract_key_fail_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_self_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___extract_key_self_tag() {
    assert_eq!(
        ::std::mem::size_of::<std___extract_key_self_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std___extract_key_self_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std___extract_key_self_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std___extract_key_self_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_first_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___extract_key_first_tag() {
    assert_eq!(
        ::std::mem::size_of::<std___extract_key_first_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std___extract_key_first_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std___extract_key_first_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std___extract_key_first_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_extract_key {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_extract_map_key {
    pub _address: u8,
}
pub type std__IsCharLikeType = std__And<_Pred>;
pub type std___make_const_lvalue_ref = *mut std_remove_reference;
pub type std___move_if_noexcept_result_t<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_unary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_unary_function___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
pub type std___derives_from_unary_function_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_binary_function___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
pub type std___derives_from_binary_function_type<_Tp> = _Tp;
pub type std___weak_result_type_imp_result_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___weak_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___enable_invoke {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__invokeENS_5__anyEz"]
    pub fn std___invoke(arg1: std___any, ...) -> std___nat;
}
pub type std___invoke_return_type = std___weak_result_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_return0 {
    pub _address: u8,
}
pub type std___invoke_return0_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_return1 {
    pub _address: u8,
}
pub type std___invoke_return1_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_return2 {
    pub _address: u8,
}
pub type std___invoke_return2_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_plus {
    pub _address: u8,
}
pub type std_plus___result_type<_Tp> = _Tp;
pub type std_plus_result_type<_Tp> = _Tp;
pub type std_plus_first_argument_type<_Tp> = _Tp;
pub type std_plus_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_minus {
    pub _address: u8,
}
pub type std_minus___result_type<_Tp> = _Tp;
pub type std_minus_result_type<_Tp> = _Tp;
pub type std_minus_first_argument_type<_Tp> = _Tp;
pub type std_minus_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multiplies {
    pub _address: u8,
}
pub type std_multiplies___result_type<_Tp> = _Tp;
pub type std_multiplies_result_type<_Tp> = _Tp;
pub type std_multiplies_first_argument_type<_Tp> = _Tp;
pub type std_multiplies_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_divides {
    pub _address: u8,
}
pub type std_divides___result_type<_Tp> = _Tp;
pub type std_divides_result_type<_Tp> = _Tp;
pub type std_divides_first_argument_type<_Tp> = _Tp;
pub type std_divides_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_modulus {
    pub _address: u8,
}
pub type std_modulus___result_type<_Tp> = _Tp;
pub type std_modulus_result_type<_Tp> = _Tp;
pub type std_modulus_first_argument_type<_Tp> = _Tp;
pub type std_modulus_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negate {
    pub _address: u8,
}
pub type std_negate___result_type<_Tp> = _Tp;
pub type std_negate_result_type<_Tp> = _Tp;
pub type std_negate_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_and {
    pub _address: u8,
}
pub type std_bit_and___result_type<_Tp> = _Tp;
pub type std_bit_and_result_type<_Tp> = _Tp;
pub type std_bit_and_first_argument_type<_Tp> = _Tp;
pub type std_bit_and_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_or {
    pub _address: u8,
}
pub type std_bit_or___result_type<_Tp> = _Tp;
pub type std_bit_or_result_type<_Tp> = _Tp;
pub type std_bit_or_first_argument_type<_Tp> = _Tp;
pub type std_bit_or_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_xor {
    pub _address: u8,
}
pub type std_bit_xor___result_type<_Tp> = _Tp;
pub type std_bit_xor_result_type<_Tp> = _Tp;
pub type std_bit_xor_first_argument_type<_Tp> = _Tp;
pub type std_bit_xor_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_equal_to {
    pub _address: u8,
}
pub type std_equal_to___result_type = bool;
pub type std_equal_to_result_type = bool;
pub type std_equal_to_first_argument_type<_Tp> = _Tp;
pub type std_equal_to_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_not_equal_to {
    pub _address: u8,
}
pub type std_not_equal_to___result_type = bool;
pub type std_not_equal_to_result_type = bool;
pub type std_not_equal_to_first_argument_type<_Tp> = _Tp;
pub type std_not_equal_to_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
pub type std_less___result_type = bool;
pub type std_less_result_type = bool;
pub type std_less_first_argument_type<_Tp> = _Tp;
pub type std_less_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less_equal {
    pub _address: u8,
}
pub type std_less_equal___result_type = bool;
pub type std_less_equal_result_type = bool;
pub type std_less_equal_first_argument_type<_Tp> = _Tp;
pub type std_less_equal_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater_equal {
    pub _address: u8,
}
pub type std_greater_equal___result_type = bool;
pub type std_greater_equal_result_type = bool;
pub type std_greater_equal_first_argument_type<_Tp> = _Tp;
pub type std_greater_equal_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
pub type std_greater___result_type = bool;
pub type std_greater_result_type = bool;
pub type std_greater_first_argument_type<_Tp> = _Tp;
pub type std_greater_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_and {
    pub _address: u8,
}
pub type std_logical_and___result_type = bool;
pub type std_logical_and_result_type = bool;
pub type std_logical_and_first_argument_type<_Tp> = _Tp;
pub type std_logical_and_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_not {
    pub _address: u8,
}
pub type std_logical_not___result_type = bool;
pub type std_logical_not_result_type = bool;
pub type std_logical_not_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_or {
    pub _address: u8,
}
pub type std_logical_or___result_type = bool;
pub type std_logical_or_result_type = bool;
pub type std_logical_or_first_argument_type<_Tp> = _Tp;
pub type std_logical_or_second_argument_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reference_wrapper<_Tp> {
    pub __f_: *mut std_reference_wrapper_type<_Tp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_reference_wrapper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uses_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_arg_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_allocator_arg_t() {
    assert_eq!(
        ::std::mem::size_of::<std_allocator_arg_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_allocator_arg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_allocator_arg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_allocator_arg_t))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__113allocator_argE"]
    pub static std_allocator_arg: std_allocator_arg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple_size {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_like {
    pub _base: std_false_type,
}
pub const std_float_round_style_round_indeterminate: std_float_round_style = -1;
pub const std_float_round_style_round_toward_zero: std_float_round_style = 0;
pub const std_float_round_style_round_to_nearest: std_float_round_style = 1;
pub const std_float_round_style_round_toward_infinity: std_float_round_style = 2;
pub const std_float_round_style_round_toward_neg_infinity: std_float_round_style = 3;
pub type std_float_round_style = ::std::os::raw::c_int;
pub const std_float_denorm_style_denorm_indeterminate: std_float_denorm_style = -1;
pub const std_float_denorm_style_denorm_absent: std_float_denorm_style = 0;
pub const std_float_denorm_style_denorm_present: std_float_denorm_style = 1;
pub type std_float_denorm_style = ::std::os::raw::c_int;
pub type std___libcpp_numeric_limits_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numeric_limits {
    pub _address: u8,
}
pub type std_numeric_limits___base = u8;
pub type std_numeric_limits_type = std_numeric_limits___base;
extern "C" {
    #[link_name = "\u{1}is_specialized"]
    pub static std_is_specialized: bool;
}
extern "C" {
    #[link_name = "\u{1}digits"]
    pub static std_digits: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}digits10"]
    pub static std_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_digits10"]
    pub static std_max_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}is_signed"]
    pub static std_is_signed: bool;
}
extern "C" {
    #[link_name = "\u{1}is_integer"]
    pub static std_is_integer: bool;
}
extern "C" {
    #[link_name = "\u{1}is_exact"]
    pub static std_is_exact: bool;
}
extern "C" {
    #[link_name = "\u{1}radix"]
    pub static std_radix: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent"]
    pub static std_min_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent10"]
    pub static std_min_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent"]
    pub static std_max_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent10"]
    pub static std_max_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}has_infinity"]
    pub static std_has_infinity: bool;
}
extern "C" {
    #[link_name = "\u{1}has_quiet_NaN"]
    pub static std_has_quiet_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_signaling_NaN"]
    pub static std_has_signaling_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_denorm"]
    pub static std_has_denorm: std_float_denorm_style;
}
extern "C" {
    #[link_name = "\u{1}has_denorm_loss"]
    pub static std_has_denorm_loss: bool;
}
extern "C" {
    #[link_name = "\u{1}is_iec559"]
    pub static std_is_iec559: bool;
}
extern "C" {
    #[link_name = "\u{1}is_bounded"]
    pub static std_is_bounded: bool;
}
extern "C" {
    #[link_name = "\u{1}is_modulo"]
    pub static std_is_modulo: bool;
}
extern "C" {
    #[link_name = "\u{1}traps"]
    pub static std_traps: bool;
}
extern "C" {
    #[link_name = "\u{1}tinyness_before"]
    pub static std_tinyness_before: bool;
}
extern "C" {
    #[link_name = "\u{1}round_style"]
    pub static std_round_style: std_float_round_style;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unwrap_reference {
    pub _address: u8,
}
pub type std___unwrap_reference_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unwrap_ref_decay {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_piecewise_construct_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_piecewise_construct_t() {
    assert_eq!(
        ::std::mem::size_of::<std_piecewise_construct_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_piecewise_construct_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_piecewise_construct_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_piecewise_construct_t))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119piecewise_constructE"]
    pub static std_piecewise_construct: std_piecewise_construct_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair<_T1, _T2> {
    pub first: _T1,
    pub second: _T2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
}
pub type std_pair_first_type<_T1> = _T1;
pub type std_pair_second_type<_T2> = _T2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_input_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_input_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_input_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_output_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_output_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_output_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_output_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_output_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_output_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_bidirectional_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_random_access_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_random_access_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_random_access_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_traits_cache {
    pub _address: u8,
}
pub type std___iter_traits_cache_type = std__If;
pub type std__ITER_TRAITS = std___iter_traits_cache;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_concept_test {
    pub _address: u8,
}
pub type std___iter_concept_concept_test__Apply = std__ITER_TRAITS;
#[test]
fn bindgen_test_layout_std___iter_concept_concept_test() {
    assert_eq!(
        ::std::mem::size_of::<std___iter_concept_concept_test>(),
        1usize,
        concat!("Size of: ", stringify!(std___iter_concept_concept_test))
    );
    assert_eq!(
        ::std::mem::align_of::<std___iter_concept_concept_test>(),
        1usize,
        concat!("Alignment of ", stringify!(std___iter_concept_concept_test))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_category_test {
    pub _address: u8,
}
pub type std___iter_concept_category_test__Apply = std__ITER_TRAITS;
#[test]
fn bindgen_test_layout_std___iter_concept_category_test() {
    assert_eq!(
        ::std::mem::size_of::<std___iter_concept_category_test>(),
        1usize,
        concat!("Size of: ", stringify!(std___iter_concept_category_test))
    );
    assert_eq!(
        ::std::mem::align_of::<std___iter_concept_category_test>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___iter_concept_category_test)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_random_fallback {
    pub _address: u8,
}
pub type std___iter_concept_random_fallback__Apply = std__EnableIf;
#[test]
fn bindgen_test_layout_std___iter_concept_random_fallback() {
    assert_eq!(
        ::std::mem::size_of::<std___iter_concept_random_fallback>(),
        1usize,
        concat!("Size of: ", stringify!(std___iter_concept_random_fallback))
    );
    assert_eq!(
        ::std::mem::align_of::<std___iter_concept_random_fallback>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___iter_concept_random_fallback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___test_iter_concept<_Tester> {
    pub _base_1: _Tester,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tester>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_cache {
    pub _address: u8,
}
pub type std___iter_concept_cache_type = std__Or;
pub type std__ITER_CONCEPT = std___iter_concept_cache;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_typedefs {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_typedefs___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_concept {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_concept___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
pub type std_iterator_traits___primary_template = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_input_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_forward_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_bidirectional_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_random_access_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_contiguous_iterator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_exactly_cpp17_input_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_element_type {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_difference_type {
    pub _base: std_false_type,
}
pub type std___pointer_traits_difference_type_type = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_rebind {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_rebind___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
pub type std___pointer_traits_rebind_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
pub type std_pointer_traits_pointer<_Ptr> = _Ptr;
pub type std_pointer_traits_element_type = u8;
pub type std_pointer_traits_difference_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits_rebind {
    pub _address: u8,
}
pub type std_pointer_traits_rebind_other = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits___nat {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___rebind_pointer {
    pub _address: u8,
}
pub type std___rebind_pointer_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___to_address_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___wrap_iter<_Iter> {
    pub __i: std___wrap_iter_iterator_type<_Iter>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std___wrap_iter_iterator_type<_Iter> = _Iter;
pub type std___wrap_iter_value_type = std_iterator_traits;
pub type std___wrap_iter_difference_type = std_iterator_traits;
pub type std___wrap_iter_pointer = std_iterator_traits;
pub type std___wrap_iter_reference = std_iterator_traits;
pub type std___wrap_iter_iterator_category = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_negate<_Predicate> {
    pub __pred_: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_bind_expression {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_bind_expression {
    pub _base: std___is_bind_expression,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_placeholder {
    pub _base: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_placeholder {
    pub _base: std___is_placeholder,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_1E"]
    pub static std_placeholders__1: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_2E"]
    pub static std_placeholders__2: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_3E"]
    pub static std_placeholders__3: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_4E"]
    pub static std_placeholders__4: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_5E"]
    pub static std_placeholders__5: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_6E"]
    pub static std_placeholders__6: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_7E"]
    pub static std_placeholders__7: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_8E"]
    pub static std_placeholders__8: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_9E"]
    pub static std_placeholders__9: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders3_10E"]
    pub static std_placeholders__10: u8;
}
#[repr(C)]
pub struct std_binder1st<__Operation> {
    pub op: __Operation,
    pub value: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<__Operation>>,
}
#[repr(C)]
pub struct std_binder2nd<__Operation> {
    pub op: __Operation,
    pub value: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<__Operation>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_pointer {
    pub _base: std_false_type,
}
pub type std___pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_const_pointer {
    pub _base: std_false_type,
}
pub type std___const_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_void_pointer {
    pub _base: std_false_type,
}
pub type std___void_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_const_void_pointer {
    pub _base: std_false_type,
}
pub type std___const_void_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_size_type {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_alloc_traits_difference_type {
    pub _base: std_false_type,
}
pub type std___alloc_traits_difference_type_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_copy_assignment {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_move_assignment {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_swap {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_is_always_equal {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_rebind_other {
    pub _base: std_false_type,
}
pub type std___allocator_traits_rebind_type<_Tp> = _Tp;
pub type std___allocator_traits_rebind_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocate_hint {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_construct_impl {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_construct {
    pub _base: std___has_construct_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_destroy {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_max_size {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_select_on_container_copy_construction {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std_allocator_traits_value_type = [u8; 0usize];
pub type std_allocator_traits_pointer = [u8; 0usize];
pub type std_allocator_traits_const_pointer = [u8; 0usize];
pub type std_allocator_traits_void_pointer = [u8; 0usize];
pub type std_allocator_traits_const_void_pointer = [u8; 0usize];
pub type std_allocator_traits_difference_type = [u8; 0usize];
pub type std_allocator_traits_size_type = [u8; 0usize];
pub type std_allocator_traits_propagate_on_container_copy_assignment = u8;
pub type std_allocator_traits_propagate_on_container_move_assignment = u8;
pub type std_allocator_traits_propagate_on_container_swap = u8;
pub type std_allocator_traits_is_always_equal = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits_rebind_alloc {
    pub _address: u8,
}
pub type std_allocator_traits_rebind_alloc_other = std___allocator_traits_rebind_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits_rebind_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___rebind_alloc_helper {
    pub _address: u8,
}
pub type std___rebind_alloc_helper_type<_Traits> = _Traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_default_allocator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_move_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_copy_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___default_init_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___default_init_tag() {
    assert_eq!(
        ::std::mem::size_of::<std___default_init_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std___default_init_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std___default_init_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std___default_init_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___value_init_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___value_init_tag() {
    assert_eq!(
        ::std::mem::size_of::<std___value_init_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std___value_init_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std___value_init_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std___value_init_tag))
    );
}
pub type std___compressed_pair_elem__ParamT<_Tp> = _Tp;
pub type std___compressed_pair_elem_reference<_Tp> = *mut _Tp;
pub type std___compressed_pair_elem_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___compressed_pair {
    pub _address: u8,
}
pub type std___compressed_pair__Base1 = u8;
pub type std___compressed_pair__Base2 = u8;
#[repr(C)]
#[derive(Debug)]
pub struct std___allocation_guard<_Alloc> {
    pub __alloc_: _Alloc,
    pub __n_: std___allocation_guard__Size,
    pub __ptr_: std___allocation_guard__Pointer,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type std___allocation_guard__Pointer = std_allocator_traits;
pub type std___allocation_guard__Size = std_allocator_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std___libcpp_refstring {
    pub __imp_: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_std___libcpp_refstring() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_refstring>(),
        8usize,
        concat!("Size of: ", stringify!(std___libcpp_refstring))
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_refstring>(),
        8usize,
        concat!("Alignment of ", stringify!(std___libcpp_refstring))
    );
    fn test_field___imp_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___libcpp_refstring>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__imp_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___libcpp_refstring),
                "::",
                stringify!(__imp_)
            )
        );
    }
    test_field___imp_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121__throw_runtime_errorEPKc"]
    pub fn std___throw_runtime_error(arg1: *const ::std::os::raw::c_char);
}
#[test]
fn __bindgen_test_layout_std_allocator_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_allocator>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_allocator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_allocator>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_allocator)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_allocator_open0_const_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_allocator>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_allocator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_allocator>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_allocator)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_size_type = size_t;
pub type std_allocator_difference_type = isize;
pub type std_allocator_value_type<_Tp> = _Tp;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
pub type std_allocator_pointer<_Tp> = *mut _Tp;
pub type std_allocator_const_pointer<_Tp> = *const _Tp;
pub type std_allocator_reference<_Tp> = *mut _Tp;
pub type std_allocator_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__PairT {
    pub first: size_t,
    pub second: size_t,
}
#[test]
fn bindgen_test_layout_std__PairT() {
    assert_eq!(
        ::std::mem::size_of::<std__PairT>(),
        16usize,
        concat!("Size of: ", stringify!(std__PairT))
    );
    assert_eq!(
        ::std::mem::align_of::<std__PairT>(),
        8usize,
        concat!("Alignment of ", stringify!(std__PairT))
    );
    fn test_field_first() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std__PairT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).first) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std__PairT),
                "::",
                stringify!(first)
            )
        );
    }
    test_field_first();
    fn test_field_second() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std__PairT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).second) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std__PairT),
                "::",
                stringify!(second)
            )
        );
    }
    test_field_second();
}
#[test]
fn __bindgen_test_layout_std_hash_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_char16_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_char32_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_unsigned___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_auto_ptr_ref<_Tp> {
    pub __ptr_: *mut _Tp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_auto_ptr<_Tp> {
    pub __ptr_: *mut _Tp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_auto_ptr_element_type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std_auto_ptr_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_auto_ptr<::std::os::raw::c_void>>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_auto_ptr<::std::os::raw::c_void>)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_auto_ptr<::std::os::raw::c_void>>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_auto_ptr<::std::os::raw::c_void>)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_ptr_deleter_sfinae {
    pub _address: u8,
}
pub type std___unique_ptr_deleter_sfinae___lval_ref_type<_Deleter> = *const _Deleter;
pub type std___unique_ptr_deleter_sfinae___good_rval_ref_type<_Deleter> = *mut _Deleter;
pub type std___unique_ptr_deleter_sfinae___enable_rval_overload = std_true_type;
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_ptr {
    pub __ptr_: std___compressed_pair,
}
pub type std_unique_ptr_element_type<_Tp> = _Tp;
pub type std_unique_ptr_deleter_type<_Dp> = _Dp;
pub type std_unique_ptr_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
pub type std_unique_ptr__DeleterSFINAE = std___unique_ptr_deleter_sfinae;
pub type std_unique_ptr__LValRefType = u8;
pub type std_unique_ptr__GoodRValRefType = u8;
pub type std_unique_ptr__BadRValRefType = u8;
pub type std_unique_ptr__EnableIfDeleterDefaultConstructible = u8;
pub type std_unique_ptr__EnableIfDeleterConstructible = u8;
pub type std_unique_ptr__EnableIfMoveConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterAssignable = u8;
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_gcd_value: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_lcm_value: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_abs_value: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_sign_value: intmax_t;
}
pub const std___ll_mul_nan: intmax_t = -9223372036854775808;
extern "C" {
    #[link_name = "\u{1}min"]
    pub static std___ll_mul_min: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}max"]
    pub static std___ll_mul_max: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__a_x"]
    pub static std___ll_mul___a_x: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__a_y"]
    pub static std___ll_mul___a_y: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___ll_mul_value: intmax_t;
}
pub const std___ll_div_nan: intmax_t = -9223372036854775808;
extern "C" {
    #[link_name = "\u{1}min"]
    pub static std___ll_div_min: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}max"]
    pub static std___ll_div_max: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___ll_div_value: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__na"]
    pub static std_ratio___na: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__da"]
    pub static std_ratio___da: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__s"]
    pub static std_ratio___s: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__gcd"]
    pub static std_ratio___gcd: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_ratio_num: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_ratio_den: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_num: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_den: intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_ratio {
    pub _base: std_false_type,
}
pub type std_atto = u8;
pub type std_femto = u8;
pub type std_pico = u8;
pub type std_nano = u8;
pub type std_micro = u8;
pub type std_milli = u8;
pub type std_centi = u8;
pub type std_deci = u8;
pub type std_deca = u8;
pub type std_hecto = u8;
pub type std_kilo = u8;
pub type std_mega = u8;
pub type std_giga = u8;
pub type std_tera = u8;
pub type std_peta = u8;
pub type std_exa = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_multiply {
    pub _address: u8,
}
pub type std___ratio_multiply_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_multiply {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_divide {
    pub _address: u8,
}
pub type std___ratio_divide_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_divide {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_add {
    pub _address: u8,
}
pub type std___ratio_add_type = std_ratio_multiply;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_add {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_subtract {
    pub _address: u8,
}
pub type std___ratio_subtract_type = std_ratio_multiply;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_subtract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_not_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_gcd {
    pub _address: u8,
}
pub type std___ratio_gcd_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___is_duration {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_treat_as_floating_point {
    pub _base: std_is_floating_point,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration_values {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration<_Rep> {
    pub __rep_: std_chrono_duration_rep<_Rep>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Rep>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration___no_overflow {
    pub _address: u8,
}
pub type std_chrono_duration___no_overflow_type = u8;
pub type std_chrono_duration_rep<_Rep> = _Rep;
pub type std_chrono_duration_period = [u8; 0usize];
pub type std_chrono_nanoseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_microseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_milliseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_seconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_minutes = std_chrono_duration<::std::os::raw::c_long>;
pub type std_chrono_hours = std_chrono_duration<::std::os::raw::c_long>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___duration_eq {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___duration_lt {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_time_point<_Duration> {
    pub __d_: std_chrono_time_point_duration<_Duration>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Duration>>,
}
pub type std_chrono_time_point_clock<_Clock> = _Clock;
pub type std_chrono_time_point_duration<_Duration> = _Duration;
pub type std_chrono_time_point_rep = [u8; 0usize];
pub type std_chrono_time_point_period = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_system_clock {
    pub _address: u8,
}
pub type std_chrono_system_clock_duration = std_chrono_microseconds;
pub type std_chrono_system_clock_rep = rep;
pub type std_chrono_system_clock_period = u8;
pub type std_chrono_system_clock_time_point =
    std_chrono_time_point<std_chrono_duration<::std::os::raw::c_longlong>>;
pub const std_chrono_system_clock_is_steady: bool = false;
#[test]
fn bindgen_test_layout_std_chrono_system_clock() {
    assert_eq!(
        ::std::mem::size_of::<std_chrono_system_clock>(),
        1usize,
        concat!("Size of: ", stringify!(std_chrono_system_clock))
    );
    assert_eq!(
        ::std::mem::align_of::<std_chrono_system_clock>(),
        1usize,
        concat!("Alignment of ", stringify!(std_chrono_system_clock))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock3nowEv"]
    pub fn std_chrono_system_clock_now() -> std_chrono_system_clock_time_point;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock9to_time_tERKNS0_10time_pointIS1_NS0_8durationIxNS_5ratioILl1ELl1000000EEEEEEE"]
    pub fn std_chrono_system_clock_to_time_t(
        __t: *const std_chrono_system_clock_time_point,
    ) -> time_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock11from_time_tEl"]
    pub fn std_chrono_system_clock_from_time_t(__t: time_t) -> std_chrono_system_clock_time_point;
}
impl std_chrono_system_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_system_clock_time_point {
        std_chrono_system_clock_now()
    }
    #[inline]
    pub unsafe fn to_time_t(__t: *const std_chrono_system_clock_time_point) -> time_t {
        std_chrono_system_clock_to_time_t(__t)
    }
    #[inline]
    pub unsafe fn from_time_t(__t: time_t) -> std_chrono_system_clock_time_point {
        std_chrono_system_clock_from_time_t(__t)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_steady_clock {
    pub _address: u8,
}
pub type std_chrono_steady_clock_duration = std_chrono_nanoseconds;
pub type std_chrono_steady_clock_rep = rep;
pub type std_chrono_steady_clock_period = u8;
pub type std_chrono_steady_clock_time_point =
    std_chrono_time_point<std_chrono_steady_clock_duration>;
pub const std_chrono_steady_clock_is_steady: bool = true;
#[test]
fn bindgen_test_layout_std_chrono_steady_clock() {
    assert_eq!(
        ::std::mem::size_of::<std_chrono_steady_clock>(),
        1usize,
        concat!("Size of: ", stringify!(std_chrono_steady_clock))
    );
    assert_eq!(
        ::std::mem::align_of::<std_chrono_steady_clock>(),
        1usize,
        concat!("Alignment of ", stringify!(std_chrono_steady_clock))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12steady_clock3nowEv"]
    pub fn std_chrono_steady_clock_now() -> std_chrono_steady_clock_time_point;
}
impl std_chrono_steady_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_steady_clock_time_point {
        std_chrono_steady_clock_now()
    }
}
pub type std_chrono_high_resolution_clock = std_chrono_steady_clock;
pub const std___libcpp_polling_count: ::std::os::raw::c_int = 64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___spinning_backoff_policy {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___spinning_backoff_policy() {
    assert_eq!(
        ::std::mem::size_of::<std___spinning_backoff_policy>(),
        1usize,
        concat!("Size of: ", stringify!(std___spinning_backoff_policy))
    );
    assert_eq!(
        ::std::mem::align_of::<std___spinning_backoff_policy>(),
        1usize,
        concat!("Alignment of ", stringify!(std___spinning_backoff_policy))
    );
}
pub type std___libcpp_mutex_t = pthread_mutex_t;
pub type std___libcpp_recursive_mutex_t = pthread_mutex_t;
pub type std___libcpp_condvar_t = pthread_cond_t;
pub type std___libcpp_exec_once_flag = pthread_once_t;
pub type std___libcpp_thread_id = pthread_t;
pub type std___libcpp_thread_t = pthread_t;
pub type std___libcpp_tls_key = pthread_key_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_timed_backoff_policy {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___libcpp_timed_backoff_policy() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_timed_backoff_policy>(),
        1usize,
        concat!("Size of: ", stringify!(std___libcpp_timed_backoff_policy))
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_timed_backoff_policy>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___libcpp_timed_backoff_policy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___thread_id {
    pub __id_: std___libcpp_thread_id,
}
#[test]
fn bindgen_test_layout_std___thread_id() {
    assert_eq!(
        ::std::mem::size_of::<std___thread_id>(),
        8usize,
        concat!("Size of: ", stringify!(std___thread_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std___thread_id>(),
        8usize,
        concat!("Alignment of ", stringify!(std___thread_id))
    );
    fn test_field___id_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___thread_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__id_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___thread_id),
                "::",
                stringify!(__id_)
            )
        );
    }
    test_field___id_();
}
pub const std___legacy_memory_order___mo_relaxed: std___legacy_memory_order = 0;
pub const std___legacy_memory_order___mo_consume: std___legacy_memory_order = 1;
pub const std___legacy_memory_order___mo_acquire: std___legacy_memory_order = 2;
pub const std___legacy_memory_order___mo_release: std___legacy_memory_order = 3;
pub const std___legacy_memory_order___mo_acq_rel: std___legacy_memory_order = 4;
pub const std___legacy_memory_order___mo_seq_cst: std___legacy_memory_order = 5;
pub type std___legacy_memory_order = ::std::os::raw::c_uint;
pub type std___memory_order_underlying_t = type_;
pub const std_memory_order_memory_order_relaxed: std_memory_order = 0;
pub const std_memory_order_memory_order_consume: std_memory_order = 1;
pub const std_memory_order_memory_order_acquire: std_memory_order = 2;
pub const std_memory_order_memory_order_release: std_memory_order = 3;
pub const std_memory_order_memory_order_acq_rel: std_memory_order = 4;
pub const std_memory_order_memory_order_seq_cst: std_memory_order = 5;
pub type std_memory_order = ::std::os::raw::c_uint;
#[repr(C)]
pub struct std___cxx_atomic_base_impl {
    pub __a_value: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___cxx_atomic_impl<_Base> {
    pub _base: _Base,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Base>>,
}
pub type std___cxx_contention_t = i64;
pub type std___cxx_atomic_contention_t = std___cxx_atomic_impl<std___cxx_atomic_base_impl>;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKv"]
    pub fn std___cxx_atomic_notify_one(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKv"]
    pub fn std___cxx_atomic_notify_all(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKv"]
    pub fn std___libcpp_atomic_monitor(
        arg1: *const ::std::os::raw::c_void,
    ) -> std___cxx_contention_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKvx"]
    pub fn std___libcpp_atomic_wait(
        arg1: *const ::std::os::raw::c_void,
        arg2: std___cxx_contention_t,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___cxx_atomic_notify_one1(arg1: *const std___cxx_atomic_contention_t);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___cxx_atomic_notify_all1(arg1: *const std___cxx_atomic_contention_t);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___libcpp_atomic_monitor1(
        arg1: *const std___cxx_atomic_contention_t,
    ) -> std___cxx_contention_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEEx"]
    pub fn std___libcpp_atomic_wait1(
        arg1: *const std___cxx_atomic_contention_t,
        arg2: std___cxx_contention_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_atomic_wait_backoff_impl<_Atp, _Fn> {
    pub __a: *mut _Atp,
    pub __test_fn: _Fn,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Atp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fn>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___cxx_atomic_wait_test_fn_impl<_Atp, _Tp> {
    pub __a: *mut _Atp,
    pub __val: _Tp,
    pub __order: std_memory_order,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Atp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic___base = u8;
pub type std_atomic_value_type<_Tp> = _Tp;
pub type std_atomic_difference_type<_Tp> = std_atomic_value_type<_Tp>;
#[repr(C)]
pub struct std_atomic_flag {
    pub __a_: std___cxx_atomic_impl<std___cxx_atomic_base_impl>,
}
#[test]
fn bindgen_test_layout_std_atomic_flag() {
    assert_eq!(
        ::std::mem::size_of::<std_atomic_flag>(),
        1usize,
        concat!("Size of: ", stringify!(std_atomic_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_atomic_flag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_atomic_flag))
    );
    fn test_field___a_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_atomic_flag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__a_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_atomic_flag),
                "::",
                stringify!(__a_)
            )
        );
    }
    test_field___a_();
}
pub type std_atomic_bool = std_atomic;
pub type std_atomic_char = std_atomic;
pub type std_atomic_schar = std_atomic;
pub type std_atomic_uchar = std_atomic;
pub type std_atomic_short = std_atomic;
pub type std_atomic_ushort = std_atomic;
pub type std_atomic_int = std_atomic;
pub type std_atomic_uint = std_atomic;
pub type std_atomic_long = std_atomic;
pub type std_atomic_ulong = std_atomic;
pub type std_atomic_llong = std_atomic;
pub type std_atomic_ullong = std_atomic;
pub type std_atomic_char16_t = std_atomic;
pub type std_atomic_char32_t = std_atomic;
pub type std_atomic_wchar_t = std_atomic;
pub type std_atomic_int_least8_t = std_atomic;
pub type std_atomic_uint_least8_t = std_atomic;
pub type std_atomic_int_least16_t = std_atomic;
pub type std_atomic_uint_least16_t = std_atomic;
pub type std_atomic_int_least32_t = std_atomic;
pub type std_atomic_uint_least32_t = std_atomic;
pub type std_atomic_int_least64_t = std_atomic;
pub type std_atomic_uint_least64_t = std_atomic;
pub type std_atomic_int_fast8_t = std_atomic;
pub type std_atomic_uint_fast8_t = std_atomic;
pub type std_atomic_int_fast16_t = std_atomic;
pub type std_atomic_uint_fast16_t = std_atomic;
pub type std_atomic_int_fast32_t = std_atomic;
pub type std_atomic_uint_fast32_t = std_atomic;
pub type std_atomic_int_fast64_t = std_atomic;
pub type std_atomic_uint_fast64_t = std_atomic;
pub type std_atomic_int8_t = std_atomic;
pub type std_atomic_uint8_t = std_atomic;
pub type std_atomic_int16_t = std_atomic;
pub type std_atomic_uint16_t = std_atomic;
pub type std_atomic_int32_t = std_atomic;
pub type std_atomic_uint32_t = std_atomic;
pub type std_atomic_int64_t = std_atomic;
pub type std_atomic_uint64_t = std_atomic;
pub type std_atomic_intptr_t = std_atomic;
pub type std_atomic_uintptr_t = std_atomic;
pub type std_atomic_size_t = std_atomic;
pub type std_atomic_ptrdiff_t = std_atomic;
pub type std_atomic_intmax_t = std_atomic;
pub type std_atomic_uintmax_t = std_atomic;
pub type std___libcpp_signed_lock_free = type_;
pub type std___libcpp_unsigned_lock_free = type_;
pub type std_atomic_signed_lock_free = std_atomic;
pub type std_atomic_unsigned_lock_free = std_atomic;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_destructor<_Alloc> {
    pub __alloc_: *mut _Alloc,
    pub __s_: std___allocator_destructor_size_type,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type std___allocator_destructor___alloc_traits = std_allocator_traits;
pub type std___allocator_destructor_pointer = std___allocator_destructor___alloc_traits;
pub type std___allocator_destructor_size_type = std___allocator_destructor___alloc_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_weak_ptr {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_weak_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_weak_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_weak_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_weak_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_weak_ptr))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112bad_weak_ptrD1Ev"]
    pub fn std_bad_weak_ptr_bad_weak_ptr_destructor(this: *mut std_bad_weak_ptr);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__112bad_weak_ptr4whatEv"]
    pub fn std_bad_weak_ptr_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
pub struct std___shared_count__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_count {
    pub vtable_: *const std___shared_count__bindgen_vtable,
    pub __shared_owners_: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_std___shared_count() {
    assert_eq!(
        ::std::mem::size_of::<std___shared_count>(),
        16usize,
        concat!("Size of: ", stringify!(std___shared_count))
    );
    assert_eq!(
        ::std::mem::align_of::<std___shared_count>(),
        8usize,
        concat!("Alignment of ", stringify!(std___shared_count))
    );
    fn test_field___shared_owners_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___shared_count>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__shared_owners_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std___shared_count),
                "::",
                stringify!(__shared_owners_)
            )
        );
    }
    test_field___shared_owners_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__shared_countD1Ev"]
    pub fn std___shared_count___shared_count_destructor(this: *mut std___shared_count);
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_weak_count {
    pub _base: std___shared_count,
    pub __shared_weak_owners_: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_std___shared_weak_count() {
    assert_eq!(
        ::std::mem::size_of::<std___shared_weak_count>(),
        24usize,
        concat!("Size of: ", stringify!(std___shared_weak_count))
    );
    assert_eq!(
        ::std::mem::align_of::<std___shared_weak_count>(),
        8usize,
        concat!("Alignment of ", stringify!(std___shared_weak_count))
    );
    fn test_field___shared_weak_owners_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___shared_weak_count>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__shared_weak_owners_) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(std___shared_weak_count),
                "::",
                stringify!(__shared_weak_owners_)
            )
        );
    }
    test_field___shared_weak_owners_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count14__release_weakEv"]
    pub fn std___shared_weak_count___release_weak(this: *mut std___shared_weak_count);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count4lockEv"]
    pub fn std___shared_weak_count_lock(
        this: *mut std___shared_weak_count,
    ) -> *mut std___shared_weak_count;
}
impl std___shared_weak_count {
    #[inline]
    pub unsafe fn __release_weak(&mut self) {
        std___shared_weak_count___release_weak(self)
    }
    #[inline]
    pub unsafe fn lock(&mut self) -> *mut std___shared_weak_count {
        std___shared_weak_count_lock(self)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_countD1Ev"]
    pub fn std___shared_weak_count___shared_weak_count_destructor(
        this: *mut std___shared_weak_count,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"]
    pub fn std___shared_weak_count___get_deleter(
        this: *mut ::std::os::raw::c_void,
        arg1: *const std_type_info,
    ) -> *const ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_pointer {
    pub _base: std___shared_weak_count,
    pub __data_: std___compressed_pair,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_emplace {
    pub _base: std___shared_weak_count,
    pub __storage_: std___shared_ptr_emplace__Storage,
}
pub type std___shared_ptr_emplace__CompressedPair = std___compressed_pair;
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_emplace__Storage {
    pub __blob_: *mut ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_ptr_dummy_rebind_allocator_type {
    _unused: [u8; 0],
}
#[test]
fn __bindgen_test_layout_std_allocator_open0_std___shared_ptr_dummy_rebind_allocator_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_allocator>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_allocator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_allocator>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_allocator)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___compatible_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_deletable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_array_deletable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___well_formed_deleter {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_ptr_deleter_ctor_reqs {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_shared_ptr<_Tp> {
    pub __ptr_: *mut std_shared_ptr_element_type<_Tp>,
    pub __cntrl_: *mut std___shared_weak_count,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_shared_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr___shared_ptr_default_delete {
    pub _address: u8,
}
pub type std_shared_ptr___shared_ptr_default_allocator_type = std_allocator;
#[repr(C)]
#[derive(Debug)]
pub struct std_weak_ptr<_Tp> {
    pub __ptr_: *mut std_weak_ptr_element_type<_Tp>,
    pub __cntrl_: *mut std___shared_weak_count,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_weak_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_owner_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_enable_shared_from_this<_Tp> {
    pub __weak_this_: std_weak_ptr<_Tp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_mut {
    pub __lx: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_std___sp_mut() {
    assert_eq!(
        ::std::mem::size_of::<std___sp_mut>(),
        8usize,
        concat!("Size of: ", stringify!(std___sp_mut))
    );
    assert_eq!(
        ::std::mem::align_of::<std___sp_mut>(),
        8usize,
        concat!("Alignment of ", stringify!(std___sp_mut))
    );
    fn test_field___lx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___sp_mut>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___sp_mut),
                "::",
                stringify!(__lx)
            )
        );
    }
    test_field___lx();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__sp_mut4lockEv"]
    pub fn std___sp_mut_lock(this: *mut std___sp_mut);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__sp_mut6unlockEv"]
    pub fn std___sp_mut_unlock(this: *mut std___sp_mut);
}
impl std___sp_mut {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std___sp_mut_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std___sp_mut_unlock(self)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__get_sp_mutEPKv"]
    pub fn std___get_sp_mut(arg1: *const ::std::os::raw::c_void) -> *mut std___sp_mut;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
pub type std_iterator_iterator_category<_Category> = _Category;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_back_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type std_back_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_back_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_back_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_back_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_back_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_back_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_front_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type std_front_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_front_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_front_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_front_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_front_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_front_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
pub struct std_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub iter: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type std_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator<_CharT> {
    pub __sbuf_: *mut std_istreambuf_iterator_streambuf_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_istreambuf_iterator_iterator_category = std_input_iterator_tag;
pub type std_istreambuf_iterator_value_type<_CharT> = _CharT;
pub type std_istreambuf_iterator_difference_type = [u8; 0usize];
pub type std_istreambuf_iterator_pointer<_CharT> = *mut _CharT;
pub type std_istreambuf_iterator_reference<_CharT> = _CharT;
pub type std_istreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_istreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_istreambuf_iterator_int_type = [u8; 0usize];
pub type std_istreambuf_iterator_streambuf_type<_CharT> = std_basic_streambuf<_CharT>;
pub type std_istreambuf_iterator_istream_type = std_basic_istream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator___proxy<_CharT> {
    pub __keep_: std_istreambuf_iterator_char_type<_CharT>,
    pub __sbuf_: *mut std_istreambuf_iterator_streambuf_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istream_iterator<_Tp> {
    pub __in_stream_: *mut std_istream_iterator_istream_type,
    pub __value_: _Tp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_istream_iterator_iterator_category = std_input_iterator_tag;
pub type std_istream_iterator_value_type<_Tp> = _Tp;
pub type std_istream_iterator_difference_type<_Distance> = _Distance;
pub type std_istream_iterator_pointer<_Tp> = *const _Tp;
pub type std_istream_iterator_reference<_Tp> = *const _Tp;
pub type std_istream_iterator_char_type<_CharT> = _CharT;
pub type std_istream_iterator_traits_type<_Traits> = _Traits;
pub type std_istream_iterator_istream_type = std_basic_istream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_move_iterator<_Iter> {
    pub __i: _Iter,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std_move_iterator_iterator_type<_Iter> = _Iter;
pub type std_move_iterator_value_type = std_iterator_traits;
pub type std_move_iterator_difference_type = std_iterator_traits;
pub type std_move_iterator_pointer<_Iter> = std_move_iterator_iterator_type<_Iter>;
pub type std_move_iterator_iterator_category = std__If;
pub type std_move_iterator_reference = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostreambuf_iterator<_CharT> {
    pub __sbuf_: *mut std_ostreambuf_iterator_streambuf_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_ostreambuf_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostreambuf_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_reference = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_ostreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_ostreambuf_iterator_streambuf_type<_CharT> = std_basic_streambuf<_CharT>;
pub type std_ostreambuf_iterator_ostream_type = std_basic_ostream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostream_iterator<_CharT> {
    pub __out_stream_: *mut std_ostream_iterator_ostream_type,
    pub __delim_: *const std_ostream_iterator_char_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_ostream_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostream_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostream_iterator_reference = ::std::os::raw::c_void;
pub type std_ostream_iterator_char_type<_CharT> = _CharT;
pub type std_ostream_iterator_traits_type<_Traits> = _Traits;
pub type std_ostream_iterator_ostream_type = std_basic_ostream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_stashing_iterator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_Iter> {
    pub __t: _Iter,
    pub current: _Iter,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std_reverse_iterator_iterator_type<_Iter> = _Iter;
pub type std_reverse_iterator_difference_type = std_iterator_traits;
pub type std_reverse_iterator_reference = std_iterator_traits;
pub type std_reverse_iterator_pointer = std_iterator_traits;
pub type std_reverse_iterator_iterator_category = std__If;
pub type std_reverse_iterator_value_type = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_raw_storage_iterator<_OutputIterator> {
    pub __x_: _OutputIterator,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutputIterator>>,
}
pub type std_raw_storage_iterator_iterator_category = std_output_iterator_tag;
pub type std_raw_storage_iterator_value_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_difference_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_pointer = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_reference = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___return_temporary_buffer {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___return_temporary_buffer() {
    assert_eq!(
        ::std::mem::size_of::<std___return_temporary_buffer>(),
        1usize,
        concat!("Size of: ", stringify!(std___return_temporary_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<std___return_temporary_buffer>(),
        1usize,
        concat!("Alignment of ", stringify!(std___return_temporary_buffer))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___destruct_n {
    pub __size_: size_t,
}
#[test]
fn bindgen_test_layout_std___destruct_n() {
    assert_eq!(
        ::std::mem::size_of::<std___destruct_n>(),
        8usize,
        concat!("Size of: ", stringify!(std___destruct_n))
    );
    assert_eq!(
        ::std::mem::align_of::<std___destruct_n>(),
        8usize,
        concat!("Alignment of ", stringify!(std___destruct_n))
    );
    fn test_field___size_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___destruct_n>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___destruct_n),
                "::",
                stringify!(__size_)
            )
        );
    }
    test_field___size_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15alignEmmRPvRm"]
    pub fn std_align(
        __align: size_t,
        __sz: size_t,
        __ptr: *mut *mut ::std::os::raw::c_void,
        __space: *mut size_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___noexcept_move_assign_container {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___temp_value<_Alloc> {
    pub __v: u8,
    pub __a: *mut _Alloc,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type std___temp_value__Traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_allocator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___builtin_new_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___builtin_new_allocator___builtin_new_deleter {
    pub __size_: size_t,
    pub __align_: size_t,
}
pub type std___builtin_new_allocator___builtin_new_deleter_pointer_type =
    *mut ::std::os::raw::c_void;
#[test]
fn bindgen_test_layout_std___builtin_new_allocator___builtin_new_deleter() {
    assert_eq!(
        ::std::mem::size_of::<std___builtin_new_allocator___builtin_new_deleter>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(std___builtin_new_allocator___builtin_new_deleter)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___builtin_new_allocator___builtin_new_deleter>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std___builtin_new_allocator___builtin_new_deleter)
        )
    );
    fn test_field___size_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    std___builtin_new_allocator___builtin_new_deleter,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___builtin_new_allocator___builtin_new_deleter),
                "::",
                stringify!(__size_)
            )
        );
    }
    test_field___size_();
    fn test_field___align_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    std___builtin_new_allocator___builtin_new_deleter,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std___builtin_new_allocator___builtin_new_deleter),
                "::",
                stringify!(__align_)
            )
        );
    }
    test_field___align_();
}
pub type std___builtin_new_allocator___holder_t = std_unique_ptr;
#[test]
fn bindgen_test_layout_std___builtin_new_allocator() {
    assert_eq!(
        ::std::mem::size_of::<std___builtin_new_allocator>(),
        1usize,
        concat!("Size of: ", stringify!(std___builtin_new_allocator))
    );
    assert_eq!(
        ::std::mem::align_of::<std___builtin_new_allocator>(),
        1usize,
        concat!("Alignment of ", stringify!(std___builtin_new_allocator))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_function_call {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_function_call() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_function_call>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_function_call))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_function_call>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_function_call))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___maybe_derive_from_unary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___maybe_derive_from_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___func {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___mem_fn<_Tp> {
    pub __f_: std___mem_fn_type<_Tp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std___mem_fn_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_t<_Sp> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_t<_Sp, _Ap> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_ref_t<_Sp> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_ref_t<_Sp, _Ap> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_t<_Sp> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_t<_Sp, _Ap> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_ref_t<_Sp> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_ref_t<_Sp, _Ap> {
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_binary_function<_Arg1, _Arg2, _Result> {
    pub __f_: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1, arg2: _Arg2) -> _Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_unary_function<_Arg, _Result> {
    pub __f_: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_negate<_Predicate> {
    pub __pred_: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___comp_ref_type {
    pub _address: u8,
}
pub type std___comp_ref_type_type = std_add_lvalue_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invert<_Predicate> {
    pub __p_: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___log2_imp_value: size_t;
}
#[repr(C)]
pub struct std___independent_bits_engine<_Engine> {
    pub __e_: *mut _Engine,
    pub __w_: size_t,
    pub __w0_: size_t,
    pub __n_: size_t,
    pub __n0_: size_t,
    pub __y0_: std___independent_bits_engine__Working_result_type,
    pub __y1_: std___independent_bits_engine__Working_result_type,
    pub __mask0_: std___independent_bits_engine__Engine_result_type,
    pub __mask1_: std___independent_bits_engine__Engine_result_type,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Engine>>,
}
pub type std___independent_bits_engine_result_type<_UIntType> = _UIntType;
pub type std___independent_bits_engine__Engine_result_type = [u8; 0usize];
pub type std___independent_bits_engine__Working_result_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution<_IntType> {
    pub __p_: std_uniform_int_distribution_param_type<_IntType>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_IntType>>,
}
pub type std_uniform_int_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution_param_type<_IntType> {
    pub __a_: std_uniform_int_distribution_result_type<_IntType>,
    pub __b_: std_uniform_int_distribution_result_type<_IntType>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_IntType>>,
}
pub type std_uniform_int_distribution_param_type_distribution_type<_IntType> =
    std_uniform_int_distribution<_IntType>;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__rs_getEv"]
    pub fn std___rs_get() -> std___rs_default;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___rs_default {
    pub _address: u8,
}
pub type std___rs_default_result_type = uint_fast32_t;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_default4__c_E"]
    pub static mut std___rs_default___c_: ::std::os::raw::c_uint;
}
pub const std___rs_default__Min: std___rs_default_result_type = 0;
pub const std___rs_default__Max: std___rs_default_result_type = 4294967295;
#[test]
fn bindgen_test_layout_std___rs_default() {
    assert_eq!(
        ::std::mem::size_of::<std___rs_default>(),
        1usize,
        concat!("Size of: ", stringify!(std___rs_default))
    );
    assert_eq!(
        ::std::mem::align_of::<std___rs_default>(),
        1usize,
        concat!("Alignment of ", stringify!(std___rs_default))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_defaultC1ERKS0_"]
    pub fn std___rs_default___rs_default(
        this: *mut std___rs_default,
        arg1: *const std___rs_default,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_defaultD1Ev"]
    pub fn std___rs_default___rs_default_destructor(this: *mut std___rs_default);
}
impl std___rs_default {
    #[inline]
    pub unsafe fn new(arg1: *const std___rs_default) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___rs_default___rs_default(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___rs_default___rs_default_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___stable_sort_switch {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
pub type std_char_traits_char_type<_CharT> = _CharT;
pub type std_char_traits_int_type = ::std::os::raw::c_int;
pub type std_char_traits_off_type = std_streamoff;
pub type std_char_traits_pos_type = std_streampos;
pub type std_char_traits_state_type = mbstate_t;
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char16_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char32_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___quoted_output_proxy<_CharT, _Iter> {
    pub __first: _Iter,
    pub __last: _Iter,
    pub __delim: _CharT,
    pub __escape: _CharT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std_string_view = std_basic_string_view<::std::os::raw::c_char>;
pub type std_u16string_view = std_basic_string_view<char16_t>;
pub type std_u32string_view = std_basic_string_view<char32_t>;
pub type std_wstring_view = std_basic_string_view<u32>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view<_CharT> {
    pub __data: *const std_basic_string_view_value_type<_CharT>,
    pub __size: std_basic_string_view_size_type,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_basic_string_view_traits_type<_Traits> = _Traits;
pub type std_basic_string_view_value_type<_CharT> = _CharT;
pub type std_basic_string_view_pointer<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_pointer<_CharT> = *const _CharT;
pub type std_basic_string_view_reference<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_reference<_CharT> = *const _CharT;
pub type std_basic_string_view_const_iterator<_CharT> = std_basic_string_view_const_pointer<_CharT>;
pub type std_basic_string_view_iterator<_CharT> = std_basic_string_view_const_iterator<_CharT>;
pub type std_basic_string_view_const_reverse_iterator<_CharT> =
    std_reverse_iterator<std_basic_string_view_const_iterator<_CharT>>;
pub type std_basic_string_view_reverse_iterator<_CharT> =
    std_basic_string_view_const_reverse_iterator<_CharT>;
pub type std_basic_string_view_size_type = size_t;
pub type std_basic_string_view_difference_type = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_StateT> {
    pub __st_: _StateT,
    pub __off_: std_streamoff,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
}
extern "C" {
    #[link_name = "\u{1}__throw_length_error"]
    pub fn std___basic_string_common___throw_length_error(this: *const u8);
}
extern "C" {
    #[link_name = "\u{1}__throw_out_of_range"]
    pub fn std___basic_string_common___throw_out_of_range(this: *const u8);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___string_is_trivial_iterator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_be_converted_to_string_view {
    pub _address: u8,
}
pub type std_u16string = std_basic_string;
pub type std_u32string = std_basic_string;
#[repr(C)]
pub struct std_basic_string {
    pub _base: u8,
    pub __r_: std___compressed_pair,
}
pub type std_basic_string___self = std_basic_string;
pub type std_basic_string___self_view<_CharT> = std_basic_string_view<_CharT>;
pub type std_basic_string_traits_type<_Traits> = _Traits;
pub type std_basic_string_value_type<_CharT> = _CharT;
pub type std_basic_string_allocator_type<_Allocator> = _Allocator;
pub type std_basic_string___alloc_traits = std_allocator_traits;
pub type std_basic_string_size_type = std_basic_string___alloc_traits;
pub type std_basic_string_difference_type = std_basic_string___alloc_traits;
pub type std_basic_string_reference<_CharT> = *mut std_basic_string_value_type<_CharT>;
pub type std_basic_string_const_reference<_CharT> = *const std_basic_string_value_type<_CharT>;
pub type std_basic_string_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_const_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_iterator = std___wrap_iter<std_basic_string_pointer>;
pub type std_basic_string_const_iterator = std___wrap_iter<std_basic_string_const_pointer>;
pub type std_basic_string_reverse_iterator = std_reverse_iterator<std_basic_string_iterator>;
pub type std_basic_string_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_const_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___long {
    pub __data_: std_basic_string_pointer,
    pub __size_: std_basic_string_size_type,
    pub __cap_: std_basic_string_size_type,
}
pub const std_basic_string___min_cap: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___short<_CharT> {
    pub __data_: *mut std_basic_string_value_type<_CharT>,
    pub __bindgen_anon_1: std_basic_string___short__bindgen_ty_1,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___short__bindgen_ty_1 {
    pub __size_: ::std::os::raw::c_uchar,
}
#[repr(C)]
#[repr(align(1))]
pub struct std_basic_string___ulx<_CharT> {
    pub __lx: __BindgenUnionField<std_basic_string___long>,
    pub __lxx: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub bindgen_union_field: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub const std_basic_string___n_words: std_basic_string__bindgen_ty_2 = 0;
pub type std_basic_string__bindgen_ty_2 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___raw {
    pub __words: *mut std_basic_string_size_type,
}
#[repr(C)]
pub struct std_basic_string___rep<_CharT> {
    pub __bindgen_anon_1: std_basic_string___rep__bindgen_ty_1<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
#[repr(align(1))]
pub struct std_basic_string___rep__bindgen_ty_1<_CharT> {
    pub __l: __BindgenUnionField<std_basic_string___long>,
    pub __s: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub __r: __BindgenUnionField<std_basic_string___raw>,
    pub bindgen_union_field: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub const std_basic_string___alignment: std_basic_string__bindgen_ty_3 = 0;
pub type std_basic_string__bindgen_ty_3 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traits_eq {
    pub _address: u8,
}
pub type std___traits_eq_char_type = [u8; 0usize];
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoi(
        __str: *const std_string,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stol(
        __str: *const std_string,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoul(
        __str: *const std_string,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoll(
        __str: *const std_string,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoull(
        __str: *const std_string,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stof(__str: *const std_string, __idx: *mut size_t) -> f32;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stod(__str: *const std_string, __idx: *mut size_t) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stold(__str: *const std_string, __idx: *mut size_t) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEi"]
    pub fn std_to_string(__val: ::std::os::raw::c_int) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEj"]
    pub fn std_to_string1(__val: ::std::os::raw::c_uint) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEl"]
    pub fn std_to_string2(__val: ::std::os::raw::c_long) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEm"]
    pub fn std_to_string3(__val: ::std::os::raw::c_ulong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEx"]
    pub fn std_to_string4(__val: ::std::os::raw::c_longlong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEy"]
    pub fn std_to_string5(__val: ::std::os::raw::c_ulonglong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEf"]
    pub fn std_to_string6(__val: f32) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEd"]
    pub fn std_to_string7(__val: f64) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEe"]
    pub fn std_to_string8(__val: f64) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoi1(
        __str: *const std_wstring,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stol1(
        __str: *const std_wstring,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoul1(
        __str: *const std_wstring,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoll1(
        __str: *const std_wstring,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoull1(
        __str: *const std_wstring,
        __idx: *mut size_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stof1(__str: *const std_wstring, __idx: *mut size_t) -> f32;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stod1(__str: *const std_wstring, __idx: *mut size_t) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stold1(__str: *const std_wstring, __idx: *mut size_t) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEi"]
    pub fn std_to_wstring(__val: ::std::os::raw::c_int) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEj"]
    pub fn std_to_wstring1(__val: ::std::os::raw::c_uint) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEl"]
    pub fn std_to_wstring2(__val: ::std::os::raw::c_long) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEm"]
    pub fn std_to_wstring3(__val: ::std::os::raw::c_ulong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEx"]
    pub fn std_to_wstring4(__val: ::std::os::raw::c_longlong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEy"]
    pub fn std_to_wstring5(__val: ::std::os::raw::c_ulonglong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEf"]
    pub fn std_to_wstring6(__val: f32) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEd"]
    pub fn std_to_wstring7(__val: f64) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEe"]
    pub fn std_to_wstring8(__val: f64) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}npos"]
    pub static std_npos: std_basic_string_size_type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_errc {
    pub __v_: std_errc___lx,
}
pub const std_errc___lx_address_family_not_supported: std_errc___lx = 47;
pub const std_errc___lx_address_in_use: std_errc___lx = 48;
pub const std_errc___lx_address_not_available: std_errc___lx = 49;
pub const std_errc___lx_already_connected: std_errc___lx = 56;
pub const std_errc___lx_argument_list_too_long: std_errc___lx = 7;
pub const std_errc___lx_argument_out_of_domain: std_errc___lx = 33;
pub const std_errc___lx_bad_address: std_errc___lx = 14;
pub const std_errc___lx_bad_file_descriptor: std_errc___lx = 9;
pub const std_errc___lx_bad_message: std_errc___lx = 94;
pub const std_errc___lx_broken_pipe: std_errc___lx = 32;
pub const std_errc___lx_connection_aborted: std_errc___lx = 53;
pub const std_errc___lx_connection_already_in_progress: std_errc___lx = 37;
pub const std_errc___lx_connection_refused: std_errc___lx = 61;
pub const std_errc___lx_connection_reset: std_errc___lx = 54;
pub const std_errc___lx_cross_device_link: std_errc___lx = 18;
pub const std_errc___lx_destination_address_required: std_errc___lx = 39;
pub const std_errc___lx_device_or_resource_busy: std_errc___lx = 16;
pub const std_errc___lx_directory_not_empty: std_errc___lx = 66;
pub const std_errc___lx_executable_format_error: std_errc___lx = 8;
pub const std_errc___lx_file_exists: std_errc___lx = 17;
pub const std_errc___lx_file_too_large: std_errc___lx = 27;
pub const std_errc___lx_filename_too_long: std_errc___lx = 63;
pub const std_errc___lx_function_not_supported: std_errc___lx = 78;
pub const std_errc___lx_host_unreachable: std_errc___lx = 65;
pub const std_errc___lx_identifier_removed: std_errc___lx = 90;
pub const std_errc___lx_illegal_byte_sequence: std_errc___lx = 92;
pub const std_errc___lx_inappropriate_io_control_operation: std_errc___lx = 25;
pub const std_errc___lx_interrupted: std_errc___lx = 4;
pub const std_errc___lx_invalid_argument: std_errc___lx = 22;
pub const std_errc___lx_invalid_seek: std_errc___lx = 29;
pub const std_errc___lx_io_error: std_errc___lx = 5;
pub const std_errc___lx_is_a_directory: std_errc___lx = 21;
pub const std_errc___lx_message_size: std_errc___lx = 40;
pub const std_errc___lx_network_down: std_errc___lx = 50;
pub const std_errc___lx_network_reset: std_errc___lx = 52;
pub const std_errc___lx_network_unreachable: std_errc___lx = 51;
pub const std_errc___lx_no_buffer_space: std_errc___lx = 55;
pub const std_errc___lx_no_child_process: std_errc___lx = 10;
pub const std_errc___lx_no_link: std_errc___lx = 97;
pub const std_errc___lx_no_lock_available: std_errc___lx = 77;
pub const std_errc___lx_no_message_available: std_errc___lx = 96;
pub const std_errc___lx_no_message: std_errc___lx = 91;
pub const std_errc___lx_no_protocol_option: std_errc___lx = 42;
pub const std_errc___lx_no_space_on_device: std_errc___lx = 28;
pub const std_errc___lx_no_stream_resources: std_errc___lx = 98;
pub const std_errc___lx_no_such_device_or_address: std_errc___lx = 6;
pub const std_errc___lx_no_such_device: std_errc___lx = 19;
pub const std_errc___lx_no_such_file_or_directory: std_errc___lx = 2;
pub const std_errc___lx_no_such_process: std_errc___lx = 3;
pub const std_errc___lx_not_a_directory: std_errc___lx = 20;
pub const std_errc___lx_not_a_socket: std_errc___lx = 38;
pub const std_errc___lx_not_a_stream: std_errc___lx = 99;
pub const std_errc___lx_not_connected: std_errc___lx = 57;
pub const std_errc___lx_not_enough_memory: std_errc___lx = 12;
pub const std_errc___lx_not_supported: std_errc___lx = 45;
pub const std_errc___lx_operation_canceled: std_errc___lx = 89;
pub const std_errc___lx_operation_in_progress: std_errc___lx = 36;
pub const std_errc___lx_operation_not_permitted: std_errc___lx = 1;
pub const std_errc___lx_operation_not_supported: std_errc___lx = 102;
pub const std_errc___lx_operation_would_block: std_errc___lx = 35;
pub const std_errc___lx_owner_dead: std_errc___lx = 105;
pub const std_errc___lx_permission_denied: std_errc___lx = 13;
pub const std_errc___lx_protocol_error: std_errc___lx = 100;
pub const std_errc___lx_protocol_not_supported: std_errc___lx = 43;
pub const std_errc___lx_read_only_file_system: std_errc___lx = 30;
pub const std_errc___lx_resource_deadlock_would_occur: std_errc___lx = 11;
pub const std_errc___lx_resource_unavailable_try_again: std_errc___lx = 35;
pub const std_errc___lx_result_out_of_range: std_errc___lx = 34;
pub const std_errc___lx_state_not_recoverable: std_errc___lx = 104;
pub const std_errc___lx_stream_timeout: std_errc___lx = 101;
pub const std_errc___lx_text_file_busy: std_errc___lx = 26;
pub const std_errc___lx_timed_out: std_errc___lx = 60;
pub const std_errc___lx_too_many_files_open_in_system: std_errc___lx = 23;
pub const std_errc___lx_too_many_files_open: std_errc___lx = 24;
pub const std_errc___lx_too_many_links: std_errc___lx = 31;
pub const std_errc___lx_too_many_symbolic_link_levels: std_errc___lx = 62;
pub const std_errc___lx_value_too_large: std_errc___lx = 84;
pub const std_errc___lx_wrong_protocol_type: std_errc___lx = 41;
pub type std_errc___lx = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_errc() {
    assert_eq!(
        ::std::mem::size_of::<std_errc>(),
        4usize,
        concat!("Size of: ", stringify!(std_errc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_errc>(),
        4usize,
        concat!("Alignment of ", stringify!(std_errc))
    );
    fn test_field___v_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_errc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__v_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_errc),
                "::",
                stringify!(__v_)
            )
        );
    }
    test_field___v_();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_code_enum {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_condition_enum {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std_is_error_condition_enum_open0_std_errc_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_error_condition_enum>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_error_condition_enum)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_error_condition_enum>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_error_condition_enum)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_is_error_condition_enum_open0_std_errc___lx_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_error_condition_enum>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_error_condition_enum)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_error_condition_enum>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_error_condition_enum)
        )
    );
}
#[repr(C)]
pub struct std_error_category__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_error_category {
    pub vtable_: *const std_error_category__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_error_category() {
    assert_eq!(
        ::std::mem::size_of::<std_error_category>(),
        8usize,
        concat!("Size of: ", stringify!(std_error_category))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_category>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_category))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114error_categoryD1Ev"]
    pub fn std_error_category_error_category_destructor(this: *mut std_error_category);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category23default_error_conditionEi"]
    pub fn std_error_category_default_error_condition(
        this: *mut ::std::os::raw::c_void,
        __ev: ::std::os::raw::c_int,
    ) -> std_error_condition;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"]
    pub fn std_error_category_equivalent(
        this: *mut ::std::os::raw::c_void,
        __code: ::std::os::raw::c_int,
        __condition: *const std_error_condition,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"]
    pub fn std_error_category_equivalent1(
        this: *mut ::std::os::raw::c_void,
        __code: *const std_error_code,
        __condition: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___do_message {
    pub _base: std_error_category,
}
#[test]
fn bindgen_test_layout_std___do_message() {
    assert_eq!(
        ::std::mem::size_of::<std___do_message>(),
        8usize,
        concat!("Size of: ", stringify!(std___do_message))
    );
    assert_eq!(
        ::std::mem::align_of::<std___do_message>(),
        8usize,
        concat!("Alignment of ", stringify!(std___do_message))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__116generic_categoryEv"]
    pub fn std_generic_category() -> *const std_error_category;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115system_categoryEv"]
    pub fn std_system_category() -> *const std_error_category;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
#[test]
fn bindgen_test_layout_std_error_condition() {
    assert_eq!(
        ::std::mem::size_of::<std_error_condition>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_condition))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_condition>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_condition))
    );
    fn test_field___val_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_error_condition>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_error_condition),
                "::",
                stringify!(__val_)
            )
        );
    }
    test_field___val_();
    fn test_field___cat_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_error_condition>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cat_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std_error_condition),
                "::",
                stringify!(__cat_)
            )
        );
    }
    test_field___cat_();
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__115error_condition7messageEv"]
    pub fn std_error_condition_message(this: *const std_error_condition) -> std_string;
}
impl std_error_condition {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_condition_message(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
#[test]
fn bindgen_test_layout_std_error_code() {
    assert_eq!(
        ::std::mem::size_of::<std_error_code>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_code))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_code>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_code))
    );
    fn test_field___val_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_error_code>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_error_code),
                "::",
                stringify!(__val_)
            )
        );
    }
    test_field___val_();
    fn test_field___cat_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_error_code>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cat_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std_error_code),
                "::",
                stringify!(__cat_)
            )
        );
    }
    test_field___cat_();
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110error_code7messageEv"]
    pub fn std_error_code_message(this: *const std_error_code) -> std_string;
}
impl std_error_code {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_code_message(self)
    }
}
#[test]
fn __bindgen_test_layout_std_hash_open0_std_error_code_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_hash_open0_std_error_condition_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_hash>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_hash)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_system_error {
    pub _base: std_runtime_error,
    pub __ec_: std_error_code,
}
#[test]
fn bindgen_test_layout_std_system_error() {
    assert_eq!(
        ::std::mem::size_of::<std_system_error>(),
        32usize,
        concat!("Size of: ", stringify!(std_system_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_system_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_system_error))
    );
    fn test_field___ec_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_system_error>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ec_) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(std_system_error),
                "::",
                stringify!(__ec_)
            )
        );
    }
    test_field___ec_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeEPKc"]
    pub fn std_system_error_system_error1(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeE"]
    pub fn std_system_error_system_error2(this: *mut std_system_error, __ec: std_error_code);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error3(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryEPKc"]
    pub fn std_system_error_system_error4(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryE"]
    pub fn std_system_error_system_error5(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
    );
}
impl std_system_error {
    #[inline]
    pub unsafe fn new(__ec: std_error_code, __what_arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__ec: std_error_code, __what_arg: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error1(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(__ec: std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error2(__bindgen_tmp.as_mut_ptr(), __ec);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error3(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error4(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(__ev: ::std::os::raw::c_int, __ecat: *const std_error_category) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error5(__bindgen_tmp.as_mut_ptr(), __ev, __ecat);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorD1Ev"]
    pub fn std_system_error_system_error_destructor(this: *mut std_system_error);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__throw_system_errorEiPKc"]
    pub fn std___throw_system_error(
        ev: ::std::os::raw::c_int,
        what_arg: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_mutex {
    pub __m_: std___libcpp_mutex_t,
}
pub type std_mutex_native_handle_type = *mut std___libcpp_mutex_t;
#[test]
fn bindgen_test_layout_std_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_mutex>(),
        64usize,
        concat!("Size of: ", stringify!(std_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_mutex))
    );
    fn test_field___m_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__m_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_mutex),
                "::",
                stringify!(__m_)
            )
        );
    }
    test_field___m_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex4lockEv"]
    pub fn std_mutex_lock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex8try_lockEv"]
    pub fn std_mutex_try_lock(this: *mut std_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex6unlockEv"]
    pub fn std_mutex_unlock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutexD1Ev"]
    pub fn std_mutex_mutex_destructor(this: *mut std_mutex);
}
impl std_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_mutex_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_defer_lock_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_defer_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_defer_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_defer_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_defer_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_defer_lock_t))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_try_to_lock_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_try_to_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_try_to_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_try_to_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_try_to_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_try_to_lock_t))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_adopt_lock_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_adopt_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_adopt_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_adopt_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_adopt_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_adopt_lock_t))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110defer_lockE"]
    pub static std_defer_lock: std_defer_lock_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111try_to_lockE"]
    pub static std_try_to_lock: std_try_to_lock_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110adopt_lockE"]
    pub static std_adopt_lock: std_adopt_lock_t;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_lock_guard<_Mutex> {
    pub __m_: *mut std_lock_guard_mutex_type<_Mutex>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Mutex>>,
}
pub type std_lock_guard_mutex_type<_Mutex> = _Mutex;
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_lock<_Mutex> {
    pub __m_: *mut std_unique_lock_mutex_type<_Mutex>,
    pub __owns_: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Mutex>>,
}
pub type std_unique_lock_mutex_type<_Mutex> = _Mutex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_cv_status {
    pub __v_: std_cv_status___lx,
}
pub const std_cv_status___lx_no_timeout: std_cv_status___lx = 0;
pub const std_cv_status___lx_timeout: std_cv_status___lx = 1;
pub type std_cv_status___lx = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_cv_status() {
    assert_eq!(
        ::std::mem::size_of::<std_cv_status>(),
        4usize,
        concat!("Size of: ", stringify!(std_cv_status))
    );
    assert_eq!(
        ::std::mem::align_of::<std_cv_status>(),
        4usize,
        concat!("Alignment of ", stringify!(std_cv_status))
    );
    fn test_field___v_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_cv_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__v_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_cv_status),
                "::",
                stringify!(__v_)
            )
        );
    }
    test_field___v_();
}
#[repr(C)]
#[derive(Debug)]
pub struct std_condition_variable {
    pub __cv_: std___libcpp_condvar_t,
}
pub type std_condition_variable_native_handle_type = *mut std___libcpp_condvar_t;
#[test]
fn bindgen_test_layout_std_condition_variable() {
    assert_eq!(
        ::std::mem::size_of::<std_condition_variable>(),
        48usize,
        concat!("Size of: ", stringify!(std_condition_variable))
    );
    assert_eq!(
        ::std::mem::align_of::<std_condition_variable>(),
        8usize,
        concat!("Alignment of ", stringify!(std_condition_variable))
    );
    fn test_field___cv_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_condition_variable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cv_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_condition_variable),
                "::",
                stringify!(__cv_)
            )
        );
    }
    test_field___cv_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_oneEv"]
    pub fn std_condition_variable_notify_one(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_allEv"]
    pub fn std_condition_variable_notify_all(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable4waitERNS_11unique_lockINS_5mutexEEE"]
    pub fn std_condition_variable_wait(
        this: *mut std_condition_variable,
        __lk: *mut std_unique_lock<std_mutex>,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variableD1Ev"]
    pub fn std_condition_variable_condition_variable_destructor(this: *mut std_condition_variable);
}
impl std_condition_variable {
    #[inline]
    pub unsafe fn notify_one(&mut self) {
        std_condition_variable_notify_one(self)
    }
    #[inline]
    pub unsafe fn notify_all(&mut self) {
        std_condition_variable_notify_all(self)
    }
    #[inline]
    pub unsafe fn wait(&mut self, __lk: *mut std_unique_lock<std_mutex>) {
        std_condition_variable_wait(self, __lk)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_condition_variable_condition_variable_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_recursive_mutex {
    pub __m_: std___libcpp_recursive_mutex_t,
}
pub type std_recursive_mutex_native_handle_type = *mut std___libcpp_recursive_mutex_t;
#[test]
fn bindgen_test_layout_std_recursive_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_recursive_mutex>(),
        64usize,
        concat!("Size of: ", stringify!(std_recursive_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_recursive_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_recursive_mutex))
    );
    fn test_field___m_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_recursive_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__m_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_recursive_mutex),
                "::",
                stringify!(__m_)
            )
        );
    }
    test_field___m_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex4lockEv"]
    pub fn std_recursive_mutex_lock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex8try_lockEv"]
    pub fn std_recursive_mutex_try_lock(this: *mut std_recursive_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex6unlockEv"]
    pub fn std_recursive_mutex_unlock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexC1Ev"]
    pub fn std_recursive_mutex_recursive_mutex(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexD1Ev"]
    pub fn std_recursive_mutex_recursive_mutex_destructor(this: *mut std_recursive_mutex);
}
impl std_recursive_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_recursive_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_recursive_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_recursive_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_recursive_mutex_recursive_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_recursive_mutex_recursive_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_timed_mutex {
    pub __m_: std_mutex,
    pub __cv_: std_condition_variable,
    pub __locked_: bool,
}
#[test]
fn bindgen_test_layout_std_timed_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_timed_mutex>(),
        120usize,
        concat!("Size of: ", stringify!(std_timed_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_timed_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_timed_mutex))
    );
    fn test_field___m_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__m_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_timed_mutex),
                "::",
                stringify!(__m_)
            )
        );
    }
    test_field___m_();
    fn test_field___cv_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cv_) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(std_timed_mutex),
                "::",
                stringify!(__cv_)
            )
        );
    }
    test_field___cv_();
    fn test_field___locked_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__locked_) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(std_timed_mutex),
                "::",
                stringify!(__locked_)
            )
        );
    }
    test_field___locked_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex4lockEv"]
    pub fn std_timed_mutex_lock(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex8try_lockEv"]
    pub fn std_timed_mutex_try_lock(this: *mut std_timed_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex6unlockEv"]
    pub fn std_timed_mutex_unlock(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutexC1Ev"]
    pub fn std_timed_mutex_timed_mutex(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutexD1Ev"]
    pub fn std_timed_mutex_timed_mutex_destructor(this: *mut std_timed_mutex);
}
impl std_timed_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_timed_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_timed_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_timed_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_timed_mutex_timed_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_timed_mutex_timed_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_recursive_timed_mutex {
    pub __m_: std_mutex,
    pub __cv_: std_condition_variable,
    pub __count_: size_t,
    pub __id_: std___thread_id,
}
#[test]
fn bindgen_test_layout_std_recursive_timed_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_recursive_timed_mutex>(),
        128usize,
        concat!("Size of: ", stringify!(std_recursive_timed_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_recursive_timed_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_recursive_timed_mutex))
    );
    fn test_field___m_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_recursive_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__m_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_recursive_timed_mutex),
                "::",
                stringify!(__m_)
            )
        );
    }
    test_field___m_();
    fn test_field___cv_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_recursive_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cv_) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(std_recursive_timed_mutex),
                "::",
                stringify!(__cv_)
            )
        );
    }
    test_field___cv_();
    fn test_field___count_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_recursive_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count_) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(std_recursive_timed_mutex),
                "::",
                stringify!(__count_)
            )
        );
    }
    test_field___count_();
    fn test_field___id_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_recursive_timed_mutex>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__id_) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(std_recursive_timed_mutex),
                "::",
                stringify!(__id_)
            )
        );
    }
    test_field___id_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex4lockEv"]
    pub fn std_recursive_timed_mutex_lock(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex8try_lockEv"]
    pub fn std_recursive_timed_mutex_try_lock(this: *mut std_recursive_timed_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex6unlockEv"]
    pub fn std_recursive_timed_mutex_unlock(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexC1Ev"]
    pub fn std_recursive_timed_mutex_recursive_timed_mutex(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexD1Ev"]
    pub fn std_recursive_timed_mutex_recursive_timed_mutex_destructor(
        this: *mut std_recursive_timed_mutex,
    );
}
impl std_recursive_timed_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_recursive_timed_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_recursive_timed_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_recursive_timed_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_recursive_timed_mutex_recursive_timed_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_recursive_timed_mutex_recursive_timed_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_once_flag {
    pub __state_: std_once_flag__State_type,
}
pub type std_once_flag__State_type = ::std::os::raw::c_ulong;
#[test]
fn bindgen_test_layout_std_once_flag() {
    assert_eq!(
        ::std::mem::size_of::<std_once_flag>(),
        8usize,
        concat!("Size of: ", stringify!(std_once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_once_flag>(),
        8usize,
        concat!("Alignment of ", stringify!(std_once_flag))
    );
    fn test_field___state_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_once_flag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__state_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_once_flag),
                "::",
                stringify!(__state_)
            )
        );
    }
    test_field___state_();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___call_once_param<_Fp> {
    pub __f_: *mut _Fp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fp>>,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111__call_onceERVmPvPFvS2_E"]
    pub fn std___call_once(
        arg1: *mut std_once_flag__State_type,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale {
    pub __locale_: *mut std_locale___imp,
}
pub type std_locale_category = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale___imp {
    _unused: [u8; 0],
}
pub const std_locale_none: std_locale_category = 0;
pub const std_locale_collate: std_locale_category = 1;
pub const std_locale_ctype: std_locale_category = 2;
pub const std_locale_monetary: std_locale_category = 8;
pub const std_locale_numeric: std_locale_category = 16;
pub const std_locale_time: std_locale_category = 32;
pub const std_locale_messages: std_locale_category = 4;
pub const std_locale_all: std_locale_category = 63;
#[test]
fn bindgen_test_layout_std_locale() {
    assert_eq!(
        ::std::mem::size_of::<std_locale>(),
        8usize,
        concat!("Size of: ", stringify!(std_locale))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale))
    );
    fn test_field___locale_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_locale>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__locale_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_locale),
                "::",
                stringify!(__locale_)
            )
        );
    }
    test_field___locale_();
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__16locale4nameEv"]
    pub fn std_locale_name(this: *const std_locale) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale6globalERKS0_"]
    pub fn std_locale_global(arg1: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale7classicEv"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1Ev"]
    pub fn std_locale_locale(this: *mut std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_"]
    pub fn std_locale_locale1(this: *mut std_locale, arg1: *const std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1EPKc"]
    pub fn std_locale_locale2(this: *mut std_locale, arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_locale_locale3(this: *mut std_locale, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_PKci"]
    pub fn std_locale_locale4(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEi"]
    pub fn std_locale_locale5(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_S2_i"]
    pub fn std_locale_locale6(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeD1Ev"]
    pub fn std_locale_locale_destructor(this: *mut std_locale);
}
impl std_locale {
    #[inline]
    pub unsafe fn name(&self) -> std_string {
        std_locale_name(self)
    }
    #[inline]
    pub unsafe fn global(arg1: *const std_locale) -> std_locale {
        std_locale_global(arg1)
    }
    #[inline]
    pub unsafe fn classic() -> *const std_locale {
        std_locale_classic()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale4(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale5(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale6(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_locale_locale_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale_facet {
    pub _base: std___shared_count,
}
#[test]
fn bindgen_test_layout_std_locale_facet() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_facet>(),
        16usize,
        concat!("Size of: ", stringify!(std_locale_facet))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_facet>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale_facet))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale5facetD1Ev"]
    pub fn std_locale_facet_facet_destructor(this: *mut std_locale_facet);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_id {
    pub __flag_: std_once_flag,
    pub __id_: i32,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id9__next_idE"]
    pub static mut std_locale_id___next_id: i32;
}
#[test]
fn bindgen_test_layout_std_locale_id() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_id>(),
        16usize,
        concat!("Size of: ", stringify!(std_locale_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_id>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale_id))
    );
    fn test_field___flag_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_locale_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__flag_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_locale_id),
                "::",
                stringify!(__flag_)
            )
        );
    }
    test_field___flag_();
    fn test_field___id_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_locale_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__id_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std_locale_id),
                "::",
                stringify!(__id_)
            )
        );
    }
    test_field___id_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id5__getEv"]
    pub fn std_locale_id___get(this: *mut std_locale_id) -> ::std::os::raw::c_long;
}
impl std_locale_id {
    #[inline]
    pub unsafe fn __get(&mut self) -> ::std::os::raw::c_long {
        std_locale_id___get(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_collate {
    pub _base: std_locale_facet,
}
pub type std_collate_char_type<_CharT> = _CharT;
pub type std_collate_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}id"]
    pub static mut std_id: std_locale_id;
}
#[test]
fn __bindgen_test_layout_std_collate_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_collate>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_collate))
    );
    assert_eq!(
        ::std::mem::align_of::<std_collate>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_collate)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_collate_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_collate>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_collate))
    );
    assert_eq!(
        ::std::mem::align_of::<std_collate>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_collate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_collate_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_collate_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_collate_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_collate_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_collate_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_collate_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_collate_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_collate_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_collate_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_collate_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_collate_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_base {
    pub _address: u8,
}
pub type std_ctype_base_mask = __uint32_t;
pub const std_ctype_base_space: std_ctype_base_mask = 16384;
pub const std_ctype_base_print: std_ctype_base_mask = 262144;
pub const std_ctype_base_cntrl: std_ctype_base_mask = 512;
pub const std_ctype_base_upper: std_ctype_base_mask = 32768;
pub const std_ctype_base_lower: std_ctype_base_mask = 4096;
pub const std_ctype_base_alpha: std_ctype_base_mask = 256;
pub const std_ctype_base_digit: std_ctype_base_mask = 1024;
pub const std_ctype_base_punct: std_ctype_base_mask = 8192;
pub const std_ctype_base_xdigit: std_ctype_base_mask = 65536;
pub const std_ctype_base_blank: std_ctype_base_mask = 131072;
pub const std_ctype_base___regex_word: std_ctype_base_mask = 128;
pub const std_ctype_base_alnum: std_ctype_base_mask = 1280;
pub const std_ctype_base_graph: std_ctype_base_mask = 9472;
#[test]
fn bindgen_test_layout_std_ctype_base() {
    assert_eq!(
        ::std::mem::size_of::<std_ctype_base>(),
        1usize,
        concat!("Size of: ", stringify!(std_ctype_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ctype_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std_ctype_base))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_ctype_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_ctype>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_ctype))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ctype>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_ctype)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_ctype_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_ctype>(),
        32usize,
        concat!("Size of template specialization: ", stringify!(std_ctype))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ctype>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_ctype)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_ctype_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_ctype_byname>(),
        40usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_ctype_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_ctype_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_ctype_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_ctype_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_ctype_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_ctype_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_base {
    pub _address: u8,
}
pub const std_codecvt_base_result_ok: std_codecvt_base_result = 0;
pub const std_codecvt_base_result_partial: std_codecvt_base_result = 1;
pub const std_codecvt_base_result_error: std_codecvt_base_result = 2;
pub const std_codecvt_base_result_noconv: std_codecvt_base_result = 3;
pub type std_codecvt_base_result = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_codecvt_base() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt_base>(),
        1usize,
        concat!("Size of: ", stringify!(std_codecvt_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std_codecvt_base))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_codecvt_open0_char_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_codecvt))
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_open0_wchar_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt>(),
        24usize,
        concat!("Size of template specialization: ", stringify!(std_codecvt))
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_open0_char16_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_codecvt))
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_open0_char32_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_codecvt))
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_codecvt_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_codecvt_byname_open0_char_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt_byname>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_byname_open0_wchar_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_byname_open0_char16_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt_byname>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_codecvt_byname_open0_char32_t_char___mbstate_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_codecvt_byname>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_codecvt_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_codecvt_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numpunct {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_numpunct_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_numpunct>(),
        48usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_numpunct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_numpunct>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_numpunct)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_numpunct_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_numpunct>(),
        48usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_numpunct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_numpunct>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_numpunct)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numpunct_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_numpunct_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_numpunct_byname>(),
        48usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_numpunct_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_numpunct_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_numpunct_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_numpunct_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_numpunct_byname>(),
        48usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_numpunct_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_numpunct_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_numpunct_byname)
        )
    );
}
pub type std_streamsize = isize;
#[repr(C)]
pub struct std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base {
    pub vtable_: *const std_ios_base__bindgen_vtable,
    pub __fmtflags_: std_ios_base_fmtflags,
    pub __precision_: std_streamsize,
    pub __width_: std_streamsize,
    pub __rdstate_: std_ios_base_iostate,
    pub __exceptions_: std_ios_base_iostate,
    pub __rdbuf_: *mut ::std::os::raw::c_void,
    pub __loc_: *mut ::std::os::raw::c_void,
    pub __fn_: *mut std_ios_base_event_callback,
    pub __index_: *mut ::std::os::raw::c_int,
    pub __event_size_: size_t,
    pub __event_cap_: size_t,
    pub __iarray_: *mut ::std::os::raw::c_long,
    pub __iarray_size_: size_t,
    pub __iarray_cap_: size_t,
    pub __parray_: *mut *mut ::std::os::raw::c_void,
    pub __parray_size_: size_t,
    pub __parray_cap_: size_t,
}
pub type std_ios_base_fmtflags = ::std::os::raw::c_uint;
pub type std_ios_base_iostate = ::std::os::raw::c_uint;
pub type std_ios_base_openmode = ::std::os::raw::c_uint;
pub const std_ios_base_seekdir_beg: std_ios_base_seekdir = 0;
pub const std_ios_base_seekdir_cur: std_ios_base_seekdir = 1;
pub const std_ios_base_seekdir_end: std_ios_base_seekdir = 2;
pub type std_ios_base_seekdir = ::std::os::raw::c_uint;
pub type std_ios_base_io_state = std_ios_base_iostate;
pub type std_ios_base_open_mode = std_ios_base_openmode;
pub use self::std_ios_base_seekdir as std_ios_base_seek_dir;
pub type std_ios_base_streamoff = std_streamoff;
pub type std_ios_base_streampos = std_streampos;
pub const std_ios_base_event_erase_event: std_ios_base_event = 0;
pub const std_ios_base_event_imbue_event: std_ios_base_event = 1;
pub const std_ios_base_event_copyfmt_event: std_ios_base_event = 2;
pub type std_ios_base_event = ::std::os::raw::c_uint;
pub type std_ios_base_event_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: std_ios_base_event,
        arg2: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ),
>;
pub const std_ios_base_boolalpha: std_ios_base_fmtflags = 1;
pub const std_ios_base_dec: std_ios_base_fmtflags = 2;
pub const std_ios_base_fixed: std_ios_base_fmtflags = 4;
pub const std_ios_base_hex: std_ios_base_fmtflags = 8;
pub const std_ios_base_internal: std_ios_base_fmtflags = 16;
pub const std_ios_base_left: std_ios_base_fmtflags = 32;
pub const std_ios_base_oct: std_ios_base_fmtflags = 64;
pub const std_ios_base_right: std_ios_base_fmtflags = 128;
pub const std_ios_base_scientific: std_ios_base_fmtflags = 256;
pub const std_ios_base_showbase: std_ios_base_fmtflags = 512;
pub const std_ios_base_showpoint: std_ios_base_fmtflags = 1024;
pub const std_ios_base_showpos: std_ios_base_fmtflags = 2048;
pub const std_ios_base_skipws: std_ios_base_fmtflags = 4096;
pub const std_ios_base_unitbuf: std_ios_base_fmtflags = 8192;
pub const std_ios_base_uppercase: std_ios_base_fmtflags = 16384;
pub const std_ios_base_adjustfield: std_ios_base_fmtflags = 176;
pub const std_ios_base_basefield: std_ios_base_fmtflags = 74;
pub const std_ios_base_floatfield: std_ios_base_fmtflags = 260;
pub const std_ios_base_badbit: std_ios_base_iostate = 1;
pub const std_ios_base_eofbit: std_ios_base_iostate = 2;
pub const std_ios_base_failbit: std_ios_base_iostate = 4;
pub const std_ios_base_goodbit: std_ios_base_iostate = 0;
pub const std_ios_base_app: std_ios_base_openmode = 1;
pub const std_ios_base_ate: std_ios_base_openmode = 2;
pub const std_ios_base_binary: std_ios_base_openmode = 4;
pub const std_ios_base_in: std_ios_base_openmode = 8;
pub const std_ios_base_out: std_ios_base_openmode = 16;
pub const std_ios_base_trunc: std_ios_base_openmode = 32;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base9__xindex_E"]
    pub static mut std_ios_base___xindex_: std_atomic;
}
#[test]
fn bindgen_test_layout_std_ios_base() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base>(),
        136usize,
        concat!("Size of: ", stringify!(std_ios_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std_ios_base))
    );
    fn test_field___fmtflags_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__fmtflags_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__fmtflags_)
            )
        );
    }
    test_field___fmtflags_();
    fn test_field___precision_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__precision_) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__precision_)
            )
        );
    }
    test_field___precision_();
    fn test_field___width_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__width_) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__width_)
            )
        );
    }
    test_field___width_();
    fn test_field___rdstate_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__rdstate_) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__rdstate_)
            )
        );
    }
    test_field___rdstate_();
    fn test_field___exceptions_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__exceptions_) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__exceptions_)
            )
        );
    }
    test_field___exceptions_();
    fn test_field___rdbuf_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__rdbuf_) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__rdbuf_)
            )
        );
    }
    test_field___rdbuf_();
    fn test_field___loc_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__loc_) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__loc_)
            )
        );
    }
    test_field___loc_();
    fn test_field___fn_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__fn_) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__fn_)
            )
        );
    }
    test_field___fn_();
    fn test_field___index_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__index_) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__index_)
            )
        );
    }
    test_field___index_();
    fn test_field___event_size_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__event_size_) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__event_size_)
            )
        );
    }
    test_field___event_size_();
    fn test_field___event_cap_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__event_cap_) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__event_cap_)
            )
        );
    }
    test_field___event_cap_();
    fn test_field___iarray_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__iarray_) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__iarray_)
            )
        );
    }
    test_field___iarray_();
    fn test_field___iarray_size_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__iarray_size_) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__iarray_size_)
            )
        );
    }
    test_field___iarray_size_();
    fn test_field___iarray_cap_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__iarray_cap_) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__iarray_cap_)
            )
        );
    }
    test_field___iarray_cap_();
    fn test_field___parray_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__parray_) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__parray_)
            )
        );
    }
    test_field___parray_();
    fn test_field___parray_size_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__parray_size_) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__parray_size_)
            )
        );
    }
    test_field___parray_size_();
    fn test_field___parray_cap_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_ios_base>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__parray_cap_) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(std_ios_base),
                "::",
                stringify!(__parray_cap_)
            )
        );
    }
    test_field___parray_cap_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5imbueERKNS_6localeE"]
    pub fn std_ios_base_imbue(this: *mut std_ios_base, __loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__18ios_base6getlocEv"]
    pub fn std_ios_base_getloc(this: *const std_ios_base) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base6xallocEv"]
    pub fn std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5iwordEi"]
    pub fn std_ios_base_iword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5pwordEi"]
    pub fn std_ios_base_pword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi"]
    pub fn std_ios_base_register_callback(
        this: *mut std_ios_base,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base15sync_with_stdioEb"]
    pub fn std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5clearEj"]
    pub fn std_ios_base_clear(this: *mut std_ios_base, __state: std_ios_base_iostate);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_badbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_failbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4initEPv"]
    pub fn std_ios_base_init(this: *mut std_ios_base, __sb: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base16__call_callbacksENS0_5eventE"]
    pub fn std_ios_base___call_callbacks(this: *mut std_ios_base, arg1: std_ios_base_event);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7copyfmtERKS0_"]
    pub fn std_ios_base_copyfmt(this: *mut std_ios_base, arg1: *const std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4moveERS0_"]
    pub fn std_ios_base_move(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4swapERS0_"]
    pub fn std_ios_base_swap(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn imbue(&mut self, __loc: *const std_locale) -> std_locale {
        std_ios_base_imbue(self, __loc)
    }
    #[inline]
    pub unsafe fn getloc(&self) -> std_locale {
        std_ios_base_getloc(self)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int {
        std_ios_base_xalloc()
    }
    #[inline]
    pub unsafe fn iword(&mut self, __index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_long {
        std_ios_base_iword(self, __index)
    }
    #[inline]
    pub unsafe fn pword(
        &mut self,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void {
        std_ios_base_pword(self, __index)
    }
    #[inline]
    pub unsafe fn register_callback(
        &mut self,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    ) {
        std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn clear(&mut self, __state: std_ios_base_iostate) {
        std_ios_base_clear(self, __state)
    }
    #[inline]
    pub unsafe fn __set_badbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_badbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn __set_failbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_failbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn init(&mut self, __sb: *mut ::std::os::raw::c_void) {
        std_ios_base_init(self, __sb)
    }
    #[inline]
    pub unsafe fn __call_callbacks(&mut self, arg1: std_ios_base_event) {
        std_ios_base___call_callbacks(self, arg1)
    }
    #[inline]
    pub unsafe fn copyfmt(&mut self, arg1: *const std_ios_base) {
        std_ios_base_copyfmt(self, arg1)
    }
    #[inline]
    pub unsafe fn move_(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_move(self, arg1)
    }
    #[inline]
    pub unsafe fn swap(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_swap(self, arg1)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_baseD1Ev"]
    pub fn std_ios_base_ios_base_destructor(this: *mut std_ios_base);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_io_errc {
    pub __v_: std_io_errc___lx,
}
pub const std_io_errc___lx_stream: std_io_errc___lx = 1;
pub type std_io_errc___lx = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_io_errc() {
    assert_eq!(
        ::std::mem::size_of::<std_io_errc>(),
        4usize,
        concat!("Size of: ", stringify!(std_io_errc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_io_errc>(),
        4usize,
        concat!("Alignment of ", stringify!(std_io_errc))
    );
    fn test_field___v_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_io_errc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__v_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_io_errc),
                "::",
                stringify!(__v_)
            )
        );
    }
    test_field___v_();
}
#[test]
fn __bindgen_test_layout_std_is_error_code_enum_open0_std_io_errc_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_error_code_enum>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_error_code_enum)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_error_code_enum>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_error_code_enum)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_is_error_code_enum_open0_std_io_errc___lx_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_is_error_code_enum>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_is_error_code_enum)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_is_error_code_enum>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_is_error_code_enum)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__117iostream_categoryEv"]
    pub fn std_iostream_category() -> *const std_error_category;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_failure {
    pub _base: std_system_error,
}
#[test]
fn bindgen_test_layout_std_ios_base_failure() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_failure>(),
        32usize,
        concat!("Size of: ", stringify!(std_ios_base_failure))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_failure>(),
        8usize,
        concat!("Alignment of ", stringify!(std_ios_base_failure))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure(
        this: *mut std_ios_base_failure,
        __msg: *const std_string,
        __ec: *const std_error_code,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1EPKcRKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure1(
        this: *mut std_ios_base_failure,
        __msg: *const ::std::os::raw::c_char,
        __ec: *const std_error_code,
    );
}
impl std_ios_base_failure {
    #[inline]
    pub unsafe fn new(__msg: *const std_string, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__msg: *const ::std::os::raw::c_char, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure1(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureD1Ev"]
    pub fn std_ios_base_failure_failure_destructor(this: *mut std_ios_base_failure);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_Init {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_ios_base_Init() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_Init>(),
        1usize,
        concat!("Size of: ", stringify!(std_ios_base_Init))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_Init>(),
        1usize,
        concat!("Alignment of ", stringify!(std_ios_base_Init))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitC1Ev"]
    pub fn std_ios_base_Init_Init(this: *mut std_ios_base_Init);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitD1Ev"]
    pub fn std_ios_base_Init_Init_destructor(this: *mut std_ios_base_Init);
}
impl std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_Init_Init(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_ios_base_Init_Init_destructor(self)
    }
}
#[repr(C)]
pub struct std_basic_ios {
    pub _base: std_ios_base,
    pub __tie_: *mut std_basic_ostream,
    pub __fill_: std_basic_ios_int_type,
}
pub type std_basic_ios_char_type<_CharT> = _CharT;
pub type std_basic_ios_traits_type<_Traits> = _Traits;
pub type std_basic_ios_int_type = [u8; 0usize];
pub type std_basic_ios_pos_type = [u8; 0usize];
pub type std_basic_ios_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_storage_type {
    pub _address: u8,
}
pub type std___bit_reference___storage_type = [u8; 0usize];
pub type std___bit_reference___storage_pointer = [u8; 0usize];
#[repr(C)]
pub struct std___bit_const_reference {
    pub __seg_: std___bit_const_reference___storage_pointer,
    pub __mask_: std___bit_const_reference___storage_type,
}
pub type std___bit_const_reference___storage_type = [u8; 0usize];
pub type std___bit_const_reference___storage_pointer = [u8; 0usize];
#[repr(C)]
pub struct std___bit_array {
    pub __size_: std___bit_array_difference_type,
    pub __word_: *mut std___bit_array___storage_type,
}
pub type std___bit_array_difference_type = [u8; 0usize];
pub type std___bit_array___storage_type = [u8; 0usize];
pub type std___bit_array___storage_pointer = [u8; 0usize];
pub type std___bit_array_iterator = [u8; 0usize];
pub type std___bit_iterator_difference_type = [u8; 0usize];
pub type std___bit_iterator_value_type = bool;
pub type std___bit_iterator_pointer = u8;
pub type std___bit_iterator_reference = u8;
pub type std___bit_iterator_iterator_category = std_random_access_iterator_tag;
pub type std___bit_iterator___storage_type = [u8; 0usize];
pub type std___bit_iterator___storage_pointer = [u8; 0usize];
pub type std___bitset_difference_type = isize;
pub type std___bitset_size_type = size_t;
pub type std___bitset___storage_type = std___bitset_size_type;
pub type std___bitset___self = u8;
pub type std___bitset___storage_pointer = *mut std___bitset___storage_type;
pub type std___bitset___const_storage_pointer = *const std___bitset___storage_type;
pub const std___bitset___bits_per_word: ::std::os::raw::c_uint = 64;
pub type std___bitset_reference = u8;
pub type std___bitset_const_reference = std___bit_const_reference;
pub type std___bitset_iterator = u8;
pub type std___bitset_const_iterator = u8;
extern "C" {
    #[link_name = "\u{1}flip"]
    pub fn std___bitset_flip(this: *mut u8);
}
extern "C" {
    #[link_name = "\u{1}all"]
    pub fn std___bitset_all(this: *const u8) -> bool;
}
extern "C" {
    #[link_name = "\u{1}any"]
    pub fn std___bitset_any(this: *const u8) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__n_words"]
    pub static std_bitset___n_words: ::std::os::raw::c_uint;
}
pub type std_bitset_base = u8;
pub type std_bitset_reference = std_bitset_base;
pub type std_bitset_const_reference = std_bitset_base;
extern "C" {
    #[link_name = "\u{1}set"]
    pub fn std_bitset_set1(this: *mut u8, __pos: size_t, __val: bool) -> *mut u8;
}
extern "C" {
    #[link_name = "\u{1}reset"]
    pub fn std_bitset_reset1(this: *mut u8, __pos: size_t) -> *mut u8;
}
extern "C" {
    #[link_name = "\u{1}flip"]
    pub fn std_bitset_flip1(this: *mut u8, __pos: size_t) -> *mut u8;
}
extern "C" {
    #[link_name = "\u{1}test"]
    pub fn std_bitset_test(this: *const u8, __pos: size_t) -> bool;
}
#[repr(C)]
pub struct std_basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_streambuf<_CharT> {
    pub vtable_: *const std_basic_streambuf__bindgen_vtable,
    pub __loc_: std_locale,
    pub __binp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __ninp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __einp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __bout_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __nout_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __eout_: *mut std_basic_streambuf_char_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_basic_streambuf_char_type<_CharT> = _CharT;
pub type std_basic_streambuf_traits_type<_Traits> = _Traits;
pub type std_basic_streambuf_int_type = [u8; 0usize];
pub type std_basic_streambuf_pos_type = [u8; 0usize];
pub type std_basic_streambuf_off_type = [u8; 0usize];
#[test]
fn __bindgen_test_layout_std_basic_streambuf_open0_char_std_char_traits_open1_char_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_streambuf<::std::os::raw::c_char>>(),
        64usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_streambuf<::std::os::raw::c_char>)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_streambuf<::std::os::raw::c_char>>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_streambuf<::std::os::raw::c_char>)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_streambuf_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_streambuf<u32>>(),
        64usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_streambuf<u32>)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_streambuf<u32>>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_streambuf<u32>)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_ios_open0_char_std_char_traits_open1_char_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_ios>(),
        152usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_ios)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_ios>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_ios)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_ios_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_ios>(),
        152usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_ios)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_ios>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_ios)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_get_base {
    pub _address: u8,
}
pub const std___num_get_base___num_get_buf_sz: ::std::os::raw::c_int = 40;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_get_base5__srcE"]
    pub static std___num_get_base___src: [::std::os::raw::c_char; 33usize];
}
#[test]
fn bindgen_test_layout_std___num_get_base() {
    assert_eq!(
        ::std::mem::size_of::<std___num_get_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___num_get_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_get_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___num_get_base))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_get_base10__get_baseERNS_8ios_baseE"]
    pub fn std___num_get_base___get_base(arg1: *mut std_ios_base) -> ::std::os::raw::c_int;
}
impl std___num_get_base {
    #[inline]
    pub unsafe fn __get_base(arg1: *mut std_ios_base) -> ::std::os::raw::c_int {
        std___num_get_base___get_base(arg1)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__116__check_groupingERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPjS8_Rj"]
    pub fn std___check_grouping(
        __grouping: *const std_string,
        __g: *mut ::std::os::raw::c_uint,
        __g_end: *mut ::std::os::raw::c_uint,
        __err: *mut std_ios_base_iostate,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_get {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___num_get_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___num_get>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___num_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_get>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___num_get)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___num_get_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___num_get>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___num_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_get>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___num_get)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_num_get {
    pub _base: std_locale_facet,
}
pub type std_num_get_char_type<_CharT> = _CharT;
pub type std_num_get_iter_type<_InputIterator> = _InputIterator;
#[test]
fn __bindgen_test_layout_std_num_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_num_get>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_num_get))
    );
    assert_eq!(
        ::std::mem::align_of::<std_num_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_num_get)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_num_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_num_get>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_num_get))
    );
    assert_eq!(
        ::std::mem::align_of::<std_num_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_num_get)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_put_base {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___num_put_base() {
    assert_eq!(
        ::std::mem::size_of::<std___num_put_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___num_put_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_put_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___num_put_base))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base12__format_intEPcPKcbj"]
    pub fn std___num_put_base___format_int(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __signd: bool,
        __flags: std_ios_base_fmtflags,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base14__format_floatEPcPKcj"]
    pub fn std___num_put_base___format_float(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __flags: std_ios_base_fmtflags,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base18__identify_paddingEPcS1_RKNS_8ios_baseE"]
    pub fn std___num_put_base___identify_padding(
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut ::std::os::raw::c_char,
        __iob: *const std_ios_base,
    ) -> *mut ::std::os::raw::c_char;
}
impl std___num_put_base {
    #[inline]
    pub unsafe fn __format_int(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __signd: bool,
        __flags: std_ios_base_fmtflags,
    ) {
        std___num_put_base___format_int(__fmt, __len, __signd, __flags)
    }
    #[inline]
    pub unsafe fn __format_float(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __flags: std_ios_base_fmtflags,
    ) -> bool {
        std___num_put_base___format_float(__fmt, __len, __flags)
    }
    #[inline]
    pub unsafe fn __identify_padding(
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut ::std::os::raw::c_char,
        __iob: *const std_ios_base,
    ) -> *mut ::std::os::raw::c_char {
        std___num_put_base___identify_padding(__nb, __ne, __iob)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_put {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___num_put_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___num_put>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___num_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_put>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___num_put)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___num_put_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___num_put>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___num_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___num_put>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___num_put)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_num_put {
    pub _base: std_locale_facet,
}
pub type std_num_put_char_type<_CharT> = _CharT;
pub type std_num_put_iter_type<_OutputIterator> = _OutputIterator;
#[test]
fn __bindgen_test_layout_std_num_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_num_put>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_num_put))
    );
    assert_eq!(
        ::std::mem::align_of::<std_num_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_num_put)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_num_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_num_put>(),
        16usize,
        concat!("Size of template specialization: ", stringify!(std_num_put))
    );
    assert_eq!(
        ::std::mem::align_of::<std_num_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_num_put)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_base {
    pub _address: u8,
}
pub const std_time_base_dateorder_no_order: std_time_base_dateorder = 0;
pub const std_time_base_dateorder_dmy: std_time_base_dateorder = 1;
pub const std_time_base_dateorder_mdy: std_time_base_dateorder = 2;
pub const std_time_base_dateorder_ymd: std_time_base_dateorder = 3;
pub const std_time_base_dateorder_ydm: std_time_base_dateorder = 4;
pub type std_time_base_dateorder = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_time_base() {
    assert_eq!(
        ::std::mem::size_of::<std_time_base>(),
        1usize,
        concat!("Size of: ", stringify!(std_time_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std_time_base))
    );
}
#[repr(C)]
pub struct std___time_get_c_storage__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std___time_get_c_storage {
    pub vtable_: *const std___time_get_c_storage__bindgen_vtable,
}
pub type std___time_get_c_storage_string_type = std_basic_string;
#[repr(C)]
#[derive(Debug)]
pub struct std_time_get {
    pub _base: std_locale_facet,
    pub _base_2: std___time_get_c_storage,
}
pub type std_time_get_char_type<_CharT> = _CharT;
pub type std_time_get_iter_type<_InputIterator> = _InputIterator;
pub use self::std_time_base_dateorder as std_time_get_dateorder;
pub type std_time_get_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std_time_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_get>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_get)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_time_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_get>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_get)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std___time_get {
    pub __loc_: locale_t,
}
#[test]
fn bindgen_test_layout_std___time_get() {
    assert_eq!(
        ::std::mem::size_of::<std___time_get>(),
        8usize,
        concat!("Size of: ", stringify!(std___time_get))
    );
    assert_eq!(
        ::std::mem::align_of::<std___time_get>(),
        8usize,
        concat!("Alignment of ", stringify!(std___time_get))
    );
    fn test_field___loc_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___time_get>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__loc_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___time_get),
                "::",
                stringify!(__loc_)
            )
        );
    }
    test_field___loc_();
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getC1EPKc"]
    pub fn std___time_get___time_get(
        this: *mut std___time_get,
        __nm: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std___time_get___time_get1(this: *mut std___time_get, __nm: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getD1Ev"]
    pub fn std___time_get___time_get_destructor(this: *mut std___time_get);
}
impl std___time_get {
    #[inline]
    pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_get___time_get(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__nm: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_get___time_get1(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___time_get___time_get_destructor(self)
    }
}
#[repr(C)]
pub struct std___time_get_storage {
    pub _base: std___time_get,
    pub __weeks_: [std___time_get_storage_string_type; 14usize],
    pub __months_: [std___time_get_storage_string_type; 24usize],
    pub __am_pm_: [std___time_get_storage_string_type; 2usize],
    pub __c_: std___time_get_storage_string_type,
    pub __r_: std___time_get_storage_string_type,
    pub __x_: std___time_get_storage_string_type,
    pub __X_: std___time_get_storage_string_type,
}
pub type std___time_get_storage_string_type = std_basic_string;
#[repr(C)]
pub struct std_time_get_byname {
    pub _base: std_time_get,
    pub _base_1: std___time_get_storage,
}
pub use self::std_time_base_dateorder as std_time_get_byname_dateorder;
pub type std_time_get_byname_iter_type<_InputIterator> = _InputIterator;
pub type std_time_get_byname_char_type<_CharT> = _CharT;
pub type std_time_get_byname_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std_time_get_byname_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_get_byname>(),
        1088usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_get_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_get_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_get_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_time_get_byname_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_get_byname>(),
        1088usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_get_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_get_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_get_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std___time_put {
    pub __loc_: locale_t,
}
#[test]
fn bindgen_test_layout_std___time_put() {
    assert_eq!(
        ::std::mem::size_of::<std___time_put>(),
        8usize,
        concat!("Size of: ", stringify!(std___time_put))
    );
    assert_eq!(
        ::std::mem::align_of::<std___time_put>(),
        8usize,
        concat!("Alignment of ", stringify!(std___time_put))
    );
    fn test_field___loc_() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std___time_put>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__loc_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std___time_put),
                "::",
                stringify!(__loc_)
            )
        );
    }
    test_field___loc_();
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPcRS1_PK2tmcc"]
    pub fn std___time_put___do_put(
        this: *const std___time_put,
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut *mut ::std::os::raw::c_char,
        __tm: *const tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPwRS1_PK2tmcc"]
    pub fn std___time_put___do_put1(
        this: *const std___time_put,
        __wb: *mut u32,
        __we: *mut *mut u32,
        __tm: *const tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putC1EPKc"]
    pub fn std___time_put___time_put(
        this: *mut std___time_put,
        __nm: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std___time_put___time_put1(this: *mut std___time_put, __nm: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putD1Ev"]
    pub fn std___time_put___time_put_destructor(this: *mut std___time_put);
}
impl std___time_put {
    #[inline]
    pub unsafe fn __do_put(
        &self,
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut *mut ::std::os::raw::c_char,
        __tm: *const tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    ) {
        std___time_put___do_put(self, __nb, __ne, __tm, __fmt, __mod)
    }
    #[inline]
    pub unsafe fn __do_put1(
        &self,
        __wb: *mut u32,
        __we: *mut *mut u32,
        __tm: *const tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    ) {
        std___time_put___do_put1(self, __wb, __we, __tm, __fmt, __mod)
    }
    #[inline]
    pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_put___time_put(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__nm: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_put___time_put1(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___time_put___time_put_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_time_put {
    pub _base: std_locale_facet,
    pub _base_1: std___time_put,
}
pub type std_time_put_char_type<_CharT> = _CharT;
pub type std_time_put_iter_type<_OutputIterator> = _OutputIterator;
#[test]
fn __bindgen_test_layout_std_time_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_put>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_put)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_time_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_put>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_put)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_time_put_byname {
    pub _base: std_time_put,
}
#[test]
fn __bindgen_test_layout_std_time_put_byname_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_put_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_put_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_put_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_put_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_time_put_byname_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_time_put_byname>(),
        24usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_time_put_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_time_put_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_time_put_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base {
    pub _address: u8,
}
pub const std_money_base_part_none: std_money_base_part = 0;
pub const std_money_base_part_space: std_money_base_part = 1;
pub const std_money_base_part_symbol: std_money_base_part = 2;
pub const std_money_base_part_sign: std_money_base_part = 3;
pub const std_money_base_part_value: std_money_base_part = 4;
pub type std_money_base_part = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base_pattern {
    pub field: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_std_money_base_pattern() {
    assert_eq!(
        ::std::mem::size_of::<std_money_base_pattern>(),
        4usize,
        concat!("Size of: ", stringify!(std_money_base_pattern))
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_base_pattern>(),
        1usize,
        concat!("Alignment of ", stringify!(std_money_base_pattern))
    );
    fn test_field_field() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<std_money_base_pattern>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).field) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(std_money_base_pattern),
                "::",
                stringify!(field)
            )
        );
    }
    test_field_field();
}
#[test]
fn bindgen_test_layout_std_money_base() {
    assert_eq!(
        ::std::mem::size_of::<std_money_base>(),
        1usize,
        concat!("Size of: ", stringify!(std_money_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std_money_base))
    );
}
pub type std_moneypunct_char_type<_CharT> = _CharT;
pub type std_moneypunct_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}intl"]
    pub static std_intl: bool;
}
pub type std_moneypunct_byname_pattern = std_money_base_pattern;
pub type std_moneypunct_byname_char_type<_CharT> = _CharT;
pub type std_moneypunct_byname_string_type = std_basic_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___money_get {
    pub _address: u8,
}
pub type std___money_get_char_type<_CharT> = _CharT;
pub type std___money_get_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std___money_get_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___money_get>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___money_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___money_get>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___money_get)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___money_get_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___money_get>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___money_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___money_get>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___money_get)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_money_get {
    pub _base: std_locale_facet,
}
pub type std_money_get_char_type<_CharT> = _CharT;
pub type std_money_get_iter_type<_InputIterator> = _InputIterator;
pub type std_money_get_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__do_nothingEPv"]
    pub fn std___do_nothing(arg1: *mut ::std::os::raw::c_void);
}
#[test]
fn __bindgen_test_layout_std_money_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_money_get>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_money_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_money_get)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_money_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_money_get>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_money_get)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_get>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_money_get)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___money_put {
    pub _address: u8,
}
pub type std___money_put_char_type<_CharT> = _CharT;
pub type std___money_put_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std___money_put_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___money_put>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___money_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___money_put>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___money_put)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___money_put_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___money_put>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___money_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___money_put>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___money_put)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_money_put {
    pub _base: std_locale_facet,
}
pub type std_money_put_char_type<_CharT> = _CharT;
pub type std_money_put_iter_type<_OutputIterator> = _OutputIterator;
pub type std_money_put_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std_money_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_money_put>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_money_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_money_put)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_money_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_money_put>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_money_put)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_put>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_money_put)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages_base {
    pub _address: u8,
}
pub type std_messages_base_catalog = isize;
#[test]
fn bindgen_test_layout_std_messages_base() {
    assert_eq!(
        ::std::mem::size_of::<std_messages_base>(),
        1usize,
        concat!("Size of: ", stringify!(std_messages_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_messages_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std_messages_base))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_messages {
    pub _base: std_locale_facet,
}
pub type std_messages_char_type<_CharT> = _CharT;
pub type std_messages_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std_messages_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_messages>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_messages)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_messages>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_messages)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_messages_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_messages>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_messages)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_messages>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_messages)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_messages_byname {
    pub _base: std_messages,
}
pub type std_messages_byname_catalog = std_messages_base_catalog;
pub type std_messages_byname_string_type = std_basic_string;
#[test]
fn __bindgen_test_layout_std_messages_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_messages_byname>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_messages_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_messages_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_messages_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_messages_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_messages_byname>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_messages_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_messages_byname>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_messages_byname)
        )
    );
}
#[repr(C)]
pub struct std_wstring_convert<_Codecvt> {
    pub __byte_err_string_: std_wstring_convert_byte_string,
    pub __wide_err_string_: std_wstring_convert_wide_string,
    pub __cvtptr_: *mut _Codecvt,
    pub __cvtstate_: std_wstring_convert_state_type,
    pub __cvtcount_: size_t,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Codecvt>>,
}
pub type std_wstring_convert_byte_string = std_basic_string;
pub type std_wstring_convert_wide_string = std_basic_string;
pub type std_wstring_convert_state_type = [u8; 0usize];
pub type std_wstring_convert_int_type = std_wstring_convert_wide_string;
#[repr(C)]
pub struct std_wbuffer_convert<_Codecvt, _Elem> {
    pub _base: std_basic_streambuf<_Elem>,
    pub __extbuf_: *mut ::std::os::raw::c_char,
    pub __extbufnext_: *const ::std::os::raw::c_char,
    pub __extbufend_: *const ::std::os::raw::c_char,
    pub __extbuf_min_: [::std::os::raw::c_char; 8usize],
    pub __ebs_: size_t,
    pub __intbuf_: *mut std_wbuffer_convert_char_type<_Elem>,
    pub __ibs_: size_t,
    pub __bufptr_: *mut std_streambuf,
    pub __cv_: *mut _Codecvt,
    pub __st_: std_wbuffer_convert_state_type,
    pub __cm_: std_ios_base_openmode,
    pub __owns_eb_: bool,
    pub __owns_ib_: bool,
    pub __always_noconv_: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Codecvt>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
}
pub type std_wbuffer_convert_char_type<_Elem> = _Elem;
pub type std_wbuffer_convert_traits_type<_Tr> = _Tr;
pub type std_wbuffer_convert_int_type = [u8; 0usize];
pub type std_wbuffer_convert_pos_type = [u8; 0usize];
pub type std_wbuffer_convert_off_type = [u8; 0usize];
pub type std_wbuffer_convert_state_type = [u8; 0usize];
#[repr(C)]
pub struct std_basic_ostream {}
pub type std_basic_ostream_char_type<_CharT> = _CharT;
pub type std_basic_ostream_traits_type<_Traits> = _Traits;
pub type std_basic_ostream_int_type = [u8; 0usize];
pub type std_basic_ostream_pos_type = [u8; 0usize];
pub type std_basic_ostream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream_sentry {
    pub __ok_: bool,
    pub __os_: *mut std_basic_ostream,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_ostreamable {
    pub _base: std_false_type,
}
#[test]
fn __bindgen_test_layout_std_basic_ostream_open0_char_std_char_traits_open1_char_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_ostream>(),
        160usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_ostream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_ostream>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_ostream)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_ostream_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_ostream>(),
        160usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_ostream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_ostream>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_ostream)
        )
    );
}
#[repr(C)]
pub struct std_basic_istream {
    pub __gc_: std_streamsize,
}
pub type std_basic_istream_char_type<_CharT> = _CharT;
pub type std_basic_istream_traits_type<_Traits> = _Traits;
pub type std_basic_istream_int_type = [u8; 0usize];
pub type std_basic_istream_pos_type = [u8; 0usize];
pub type std_basic_istream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream_sentry {
    pub __ok_: bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_istreamable {
    pub _base: std_false_type,
}
#[repr(C)]
pub struct std_basic_iostream {
    pub _base: std_basic_istream,
    pub _base_1: std_basic_ostream,
}
pub type std_basic_iostream_char_type<_CharT> = _CharT;
pub type std_basic_iostream_traits_type<_Traits> = _Traits;
pub type std_basic_iostream_int_type = [u8; 0usize];
pub type std_basic_iostream_pos_type = [u8; 0usize];
pub type std_basic_iostream_off_type = [u8; 0usize];
#[test]
fn __bindgen_test_layout_std_basic_istream_open0_char_std_char_traits_open1_char_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_istream>(),
        168usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_istream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_istream>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_istream)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_istream_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_istream>(),
        168usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_istream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_istream>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_istream)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_basic_iostream_open0_char_std_char_traits_open1_char_close1_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<std_basic_iostream>(),
        176usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_basic_iostream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_basic_iostream>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_basic_iostream)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__13cinE"]
    pub static mut std_cin: std_istream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14wcinE"]
    pub static mut std_wcin: std_wistream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14coutE"]
    pub static mut std_cout: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15wcoutE"]
    pub static mut std_wcout: std_wostream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14cerrE"]
    pub static mut std_cerr: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15wcerrE"]
    pub static mut std_wcerr: std_wostream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14clogE"]
    pub static mut std_clog: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15wclogE"]
    pub static mut std_wclog: std_wostream;
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char16_t_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_char32_t_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_std_char_traits_open0_wchar_t_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_char_traits)
        )
    );
}
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13bad_exceptionD1Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}__ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt14get_unexpectedv"]
    pub fn std_get_unexpected() -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt10unexpectedv"]
    pub fn std_unexpected();
}
pub type std_terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}__ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt13get_terminatev"]
    pub fn std_get_terminate() -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt9terminatev"]
    pub fn std_terminate();
}
extern "C" {
    #[link_name = "\u{1}__ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZSt19uncaught_exceptionsv"]
    pub fn std_uncaught_exceptions() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZSt17current_exceptionv"]
    pub fn std_current_exception() -> std_exception_ptr;
}
extern "C" {
    #[link_name = "\u{1}__ZSt17rethrow_exceptionSt13exception_ptr"]
    pub fn std_rethrow_exception(arg1: std_exception_ptr);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_exception_ptr {
    pub __ptr_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_std_exception_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std_exception_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception_ptr))
    );
    fn test_field___ptr_() {
        assert_eq!(
            unsafe {
